[{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956cd"
  },
  "id": "52940",
  "title": "Brown Stew Chicken",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
  "instructions": [
    "Squeeze lime over chicken and rub well. Drain off excess lime juice. Combine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour. Heat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce. Lightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces. Drain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes. Mix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender."
  ],
  "ingredients": [
    [
      "1 whole",
      "Chicken"
    ],
    [
      "1 chopped",
      "Tomato"
    ],
    [
      "2 chopped",
      "Onions"
    ],
    [
      "2 chopped",
      "Garlic Clove"
    ],
    [
      "1 chopped",
      "Red Pepper"
    ],
    [
      "1 chopped",
      "Carrots"
    ],
    [
      "1",
      "Lime"
    ],
    [
      "2 tsp",
      "Thyme"
    ],
    [
      "1 tsp ",
      "Allspice"
    ],
    [
      "2 tbs",
      "Soy Sauce"
    ],
    [
      "2 tsp",
      "Cornstarch"
    ],
    [
      "2 cups ",
      "Coconut Milk"
    ],
    [
      "1 tbs",
      "Vegetable Oil"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956cf"
  },
  "id": "52846",
  "title": "Chicken & mushroom Hotpot",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg",
  "instructions": [
    "Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.  Once the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.  Take the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.  Carefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.  Brush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown."
  ],
  "ingredients": [
    [
      "50g",
      "Butter"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "100g ",
      "Mushrooms"
    ],
    [
      "40g",
      "Plain Flour"
    ],
    [
      "1",
      "Chicken Stock Cube"
    ],
    [
      "pinch",
      "Nutmeg"
    ],
    [
      "pinch",
      "Mustard Powder"
    ],
    [
      "250g",
      "Chicken"
    ],
    [
      "2 Handfuls",
      "Sweetcorn"
    ],
    [
      "2 large",
      "Potatoes"
    ],
    [
      "1 knob",
      "Butter"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956d1"
  },
  "id": "52956",
  "title": "Chicken Congee",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/1529446352.jpg",
  "instructions": [
    "STEP 1 - MARINATING THE CHICKEN In a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well. Set the chicken aside. STEP 2 - RINSE THE WHITE RICE Rinse the rice in a metal bowl or pot a couple times and then drain the water. STEP 2 - BOILING THE WHITE RICE Next add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes. After 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference. Next add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes. After an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds. Serve the rice porridge in a bowl Optional: add Coriander on top of the rice porridge."
  ],
  "ingredients": [
    [
      "8 oz ",
      "Chicken"
    ],
    [
      "pinch",
      "Salt"
    ],
    [
      "pinch",
      "Pepper"
    ],
    [
      "1 tsp ",
      "Ginger Cordial"
    ],
    [
      "1 tsp ",
      "Ginger"
    ],
    [
      "1 tbs",
      "Spring Onions"
    ],
    [
      "1/2 cup ",
      "Rice"
    ],
    [
      "8 cups ",
      "Water"
    ],
    [
      "2 oz ",
      "Coriander"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956d3"
  },
  "id": "52831",
  "title": "Chicken Karaage",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
  "instructions": [
    "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.  Add 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl  Add a handful of chicken to the potato starch and toss to coat each piece evenly.  Fry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges."
  ],
  "ingredients": [
    [
      "450 grams Boneless skin",
      "Chicken thigh"
    ],
    [
      "1 tablespoon",
      "Ginger"
    ],
    [
      "1 clove",
      "Garlic"
    ],
    [
      "2 tablespoons",
      "Soy sauce"
    ],
    [
      "1 tablespoon",
      "Sake"
    ],
    [
      "2 teaspoon",
      "Granulated sugar"
    ],
    [
      "1/3 cup",
      "Potato starch"
    ],
    [
      "1/3 cup",
      "Vegetable oil"
    ],
    [
      "1/3 cup",
      "Lemon"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956d5"
  },
  "id": "53011",
  "title": "Chicken Quinoa Greek Salad",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/k29viq1585565980.jpg",
  "instructions": [
    "Cook the quinoa following the pack instructions, then rinse in cold water and drain thoroughly.  Meanwhile, mix the butter, chilli and garlic into a paste. Toss the chicken fillets in 2 tsp of the olive oil with some seasoning. Lay in a hot griddle pan and cook for 3-4 mins each side or until cooked through. Transfer to a plate, dot with the spicy butter and set aside to melt.  Next, tip the tomatoes, olives, onion, feta and mint into a bowl. Toss in the cooked quinoa. Stir through the remaining olive oil, lemon juice and zest, and season well. Serve with the chicken fillets on top, drizzled with any buttery chicken juices."
  ],
  "ingredients": [
    [
      "225g",
      "Quinoa"
    ],
    [
      "25g",
      "Butter"
    ],
    [
      "1 chopped",
      "Red Chilli"
    ],
    [
      "1 clove finely chopped",
      "Garlic"
    ],
    [
      "400g",
      "Chicken Breast"
    ],
    [
      "2 tbs",
      "Olive Oil"
    ],
    [
      "Handful",
      "Black Olives"
    ],
    [
      "1 chopped",
      "Red Onions"
    ],
    [
      "100g ",
      "Feta"
    ],
    [
      "Chopped",
      "Mint"
    ],
    [
      "Juice of 1/2",
      "Lemon"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956d7"
  },
  "id": "52933",
  "title": "Rappie Pie",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/ruwpww1511817242.jpg",
  "instructions": [
    "Preheat oven to 400 degrees F (200 degrees C). Grease a 10x14x2-inch baking pan. Heat margarine in a skillet over medium heat; stir in onion. Cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue to cook and stir until onion is very tender and dark brown, about 40 minutes more. Bring chicken broth to a boil in a large pot; stir in chicken breasts, reduce heat, and simmer until chicken is no longer pink at the center, about 20 minutes. Remove from heat. Remove chicken breasts to a plate using a slotted spoon; reserve broth. Juice potatoes with an electric juicer; place dry potato flesh into a bowl and discard juice. Stir salt and pepper into potatoes; stir in enough reserved broth to make the mixture the consistency of oatmeal. Set remaining broth aside. Spread half of potato mixture evenly into the prepared pan. Lay cooked chicken breast evenly over potatoes; scatter caramelized onion evenly over chicken. Spread remaining potato mixture over onions and chicken to cover. Bake in the preheated oven until golden brown, about 1 hour. Reheat chicken broth; pour over individual servings as desired."
  ],
  "ingredients": [
    [
      "2 tbs",
      "Butter"
    ],
    [
      "2 chopped",
      "Onions"
    ],
    [
      "4 qt ",
      "Chicken Stock"
    ],
    [
      "1.5kg",
      "Chicken Breast"
    ],
    [
      "4kg",
      "Potatoes"
    ],
    [
      "2 tbs",
      "Salt"
    ],
    [
      "1tbsp",
      "Black Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956d9"
  },
  "id": "53039",
  "title": "Piri-piri chicken and slaw",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/hglsbl1614346998.jpg",
  "instructions": [
    "STEP 1  Whizz together all of the marinade ingredients in a small food processor. Rub the marinade onto the chicken and leave for 1 hour at room temperature.  STEP 2  Heat the oven to 190C/fan 170C/gas 5. Put the chicken in a roasting tray and cook for 1 hour 20 minutes. Rest under loose foil for 20 minutes. While the chicken is resting, mix together the slaw ingredients and season. Serve the chicken with slaw, fries and condiments."
  ],
  "ingredients": [
    [
      "1.5kg",
      "Chicken"
    ],
    [
      "3 chopped",
      "Red Chilli"
    ],
    [
      "2 cloves",
      "Garlic"
    ],
    [
      "1 tsp ",
      "Ginger"
    ],
    [
      "1 tsp ",
      "Dried Oregano"
    ],
    [
      "1 tsp ",
      "Coriander"
    ],
    [
      "1 tsp ",
      "Paprika"
    ],
    [
      "2 tbs",
      "Red Wine Vinegar"
    ],
    [
      "2 tbs",
      "Oil"
    ],
    [
      "1 sliced",
      "Red Onions"
    ],
    [
      "2",
      "Carrots"
    ],
    [
      "1",
      "Beetroot"
    ],
    [
      "4 leaves",
      "Cabbage"
    ],
    [
      "2 tbs",
      "Mayonnaise"
    ],
    [
      "2 tbs",
      "Greek Yogurt"
    ],
    [
      "2 tbs",
      "Red Wine Vinegar"
    ],
    [
      "1 tsp ",
      "Cumin Seeds"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956db"
  },
  "id": "52998",
  "title": "Corned Beef and Cabbage",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/xb97a81583266727.jpg",
  "instructions": [
    "1  Place corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound or until tender.  2  Add whole potatoes and peeled and cut carrots, and cook until the vegetables are almost tender. Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.  3  Place vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain."
  ],
  "ingredients": [
    [
      "3 Lbs",
      "Beef Brisket"
    ],
    [
      "10",
      "Small Potatoes"
    ],
    [
      "5",
      "Carrots"
    ],
    [
      "1 head",
      "Cabbage"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956dd"
  },
  "id": "53020",
  "title": "Rosół (Polish Chicken Soup)",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/lx1kkj1593349302.jpg",
  "instructions": [
    "Add chicken to a large Dutch oven or stock pot  Cover with water Bring to a boil and simmer for 2 to 2 1/2 hours, skimming any impurities off the top to insure a clear broth If your pot is big enough, add the vegetables and spices for the last hour of the cooking time My Dutch oven wasn’t big enough to hold everything, just the chicken and other bones filled the pot, so I cooked the meat/bones for the full cooking time, then removed them, and cooked the vegetables and spices separately Strain everything out of the broth Bone the chicken, pulling the meat into large chunks Slice the carrots Return the chicken and carrots to the broth Cook noodles according to package instructions if you’re using them Add noodles to bowl and then top with hot soup"
  ],
  "ingredients": [
    [
      "4 Chopped",
      "Chicken Legs"
    ],
    [
      "2 large",
      "Onions"
    ],
    [
      "5 chopped",
      "Carrots"
    ],
    [
      "1 chopped",
      "Leek"
    ],
    [
      "1 small",
      "Celery"
    ],
    [
      "1/4 ",
      "Cabbage"
    ],
    [
      "1 whole",
      "Cloves"
    ],
    [
      "1tsp",
      "Allspice"
    ],
    [
      "2",
      "Bay Leaf"
    ],
    [
      "4 sprigs",
      "Parsley"
    ],
    [
      "4 sprigs",
      "Dill"
    ],
    [
      "1 tsp ",
      "Pepper"
    ],
    [
      "1 tbs",
      "Salt"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956df"
  },
  "id": "52826",
  "title": "Braised Beef Chilli",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/uuqvwu1504629254.jpg",
  "instructions": [
    "Preheat the oven to 120C/225F/gas mark 1.  Take the meat out of the fridge to de-chill. Pulse the onions and garlic in a food processor until finely chopped. Heat 2 tbsp olive oil in a large casserole and sear the meat on all sides until golden.  Set to one side and add another small slug of oil to brown the chorizo. Remove and add the onion and garlic, spices, herbs and chillies then cook until soft in the chorizo oil. Season with salt and pepper and add the vinegar, tomatoes, ketchup and sugar.  Put all the meat back into the pot with 400ml water (or red wine if you prefer), bring up to a simmer and cook, covered, in the low oven.  After 2 hours, check the meat and add the beans. Cook for a further hour and just before serving, pull the meat apart with a pair of forks."
  ],
  "ingredients": [
    [
      "1kg",
      "Beef"
    ],
    [
      "3",
      "Onions"
    ],
    [
      "4 cloves",
      "Garlic"
    ],
    [
      "Dash",
      "Olive oil"
    ],
    [
      "300g",
      "Chorizo"
    ],
    [
      "2 tsp",
      "Cumin"
    ],
    [
      "2 tsp",
      "All spice"
    ],
    [
      "1 tsp",
      "Cloves"
    ],
    [
      "1 large",
      "Cinnamon stick"
    ],
    [
      "3",
      "Bay Leaves"
    ],
    [
      "2 tsp dried",
      "Oregano"
    ],
    [
      "2 ancho",
      "Ancho Chillies"
    ],
    [
      "3 tbsp",
      "Balsamic Vinegar"
    ],
    [
      "2 x 400g",
      "Plum Tomatoes"
    ],
    [
      "2 tbsp",
      "Tomato Ketchup"
    ],
    [
      "2 tbsp",
      "Dark Brown Sugar"
    ],
    [
      "2 x 400g tins",
      "Borlotti Beans"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956e1"
  },
  "id": "53055",
  "title": "Cevapi Sausages",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/vc08jn1628769553.jpg",
  "instructions": [
    "Place the ground meat in a bowl. Chop the onion very finely and grate the garlic cloves. Add to the bowl. Add the chopped parsley, all sorts of paprika, baking soda, dried breadcrumbs, water, Vegeta, salt, and pepper. Mix well with the hand mixer fitted with the dough hooks. Cover the bowl with cling film/ plastic foil and leave to rest for 1 or 2 hours in the refrigerator. Take portions of the meat mixture, about 50-55 g/ 1.7-1.9 oz/ ¼ cup portions, and form the cevapi. The rolls should be about as thick as your thumb and about 7-10 cm/ 3-4 inches long. I had 18 sausages. The recipe can be easily doubled. Grill the cevapcici on the hot grill pan or on the barbecue for about 12-14 minutes, turning them several times in between, or until brown and cooked through. I checked by cutting one in the middle and then grilling the following batches for the same period of time. Serve hot as suggested above. The cevapcici can be reheated in the oven at 180 degrees Celsius/ 350 degrees Fahrenheit for about 10 minutes or until heated through. Check one, if it is not hot enough, give the sausages a few more minutes."
  ],
  "ingredients": [
    [
      "500g",
      "Minced Beef"
    ],
    [
      "250g",
      "Minced Pork"
    ],
    [
      "1",
      "Onion"
    ],
    [
      "4 cloves",
      "Garlic"
    ],
    [
      "3 tblsp chopped",
      "Parsley"
    ],
    [
      "1 tbs",
      "Paprika"
    ],
    [
      "3/4 teaspoon",
      "Baking Powder"
    ],
    [
      "2 tbs",
      "Breadcrumbs"
    ],
    [
      "3 tbs",
      "Water"
    ],
    [
      "1",
      "Vegetable Stock Cube"
    ],
    [
      "1 tsp ",
      "Salt"
    ],
    [
      "1 tsp ",
      "Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956e3"
  },
  "id": "52780",
  "title": "Potato Gratin with Chicken",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/qwrtut1468418027.jpg",
  "instructions": [
    "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach."
  ],
  "ingredients": [
    [
      "800g",
      "Potatoes"
    ],
    [
      "3",
      "Onions"
    ],
    [
      "2 tblsp",
      "Olive Oil"
    ],
    [
      "100ml",
      "Chicken Stock"
    ],
    [
      "1 pot",
      "Creme Fraiche"
    ],
    [
      "Topping",
      "Parmesan"
    ],
    [
      "4",
      "Chicken Breasts"
    ],
    [
      "4",
      "Bacon"
    ],
    [
      "Topping",
      "Spinach"
    ],
    [
      "Topping",
      "Peas"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956e5"
  },
  "id": "53063",
  "title": "Chivito uruguayo",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/n7qnkb1630444129.jpg",
  "instructions": [
    "Crush the meat so that it is finite and we put it on a griddle to brown. Put the eggs, bacon and ham to fry. Cut the bread in half, put the beef brisket, the fried eggs, the bacon, the ham, the mozzarella, the tomato and the lettuce. Cover with the other half of the bread and serve."
  ],
  "ingredients": [
    [
      "2",
      "Beef Brisket"
    ],
    [
      "2",
      "Bread"
    ],
    [
      "1",
      "Lettuce"
    ],
    [
      "1",
      "Tomato"
    ],
    [
      "100g ",
      "Ham"
    ],
    [
      "100g ",
      "Mozzarella"
    ],
    [
      "100g ",
      "Bacon"
    ],
    [
      "1",
      "Egg"
    ],
    [
      "1",
      "Onion"
    ],
    [
      "1",
      "Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956e7"
  },
  "id": "52979",
  "title": "Bitterballen (Dutch meatballs)",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/lhqev81565090111.jpg",
  "instructions": [
    "Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thick paste. Slowly stir in the stock, making sure the roux absorbs the liquid. Simmer for a couple of minutes on a low heat while you stir in the onion, parsley and the shredded meat. The mixture should thicken and turn into a heavy, thick sauce.  Pour the mixture into a shallow container, cover and refrigerate for several hours, or until the sauce has solidified.  Take a heaping tablespoon of the cold, thick sauce and quickly roll it into a small ball. Roll lightly through the flour, then the egg and finally the breadcrumbs. Make sure that the egg covers the whole surface of the bitterbal. When done, refrigerate the snacks while the oil in your fryer heats up to 190C (375F). Fry four bitterballen at a time, until golden.  Serve on a plate with a nice grainy or spicy mustard.  "
  ],
  "ingredients": [
    [
      "100g ",
      "Butter"
    ],
    [
      "150g",
      "Flour"
    ],
    [
      "700ml",
      "Beef Stock"
    ],
    [
      "30g",
      "Onion"
    ],
    [
      "1 tbs",
      "Parsley"
    ],
    [
      "400g",
      "Beef"
    ],
    [
      "Pinch",
      "Salt"
    ],
    [
      "Pinch",
      "Pepper"
    ],
    [
      "Pinch",
      "Nutmeg"
    ],
    [
      "50g",
      "Flour"
    ],
    [
      "2 Beaten ",
      "Eggs"
    ],
    [
      "50g",
      "Breadcrumbs"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956e9"
  },
  "id": "53058",
  "title": "Croatian Bean Stew",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/tnwy8m1628770384.jpg",
  "instructions": [
    "Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the beans together with the vegetables into it, put the sausages inside and cook for further 20 minutes on a low heat. Or, put it in an oven and bake it at a temperature of 180ºC/350ºF for 30 minutes. This dish is even better reheated the next day."
  ],
  "ingredients": [
    [
      "2 cans",
      "Cannellini Beans"
    ],
    [
      "3 tbs",
      "Vegetable Oil"
    ],
    [
      "2 cups ",
      "Tomatoes"
    ],
    [
      "5",
      "Challots"
    ],
    [
      "2 cloves",
      "Garlic"
    ],
    [
      "Pinch",
      "Parsley"
    ],
    [
      "1/2 kg chopped ",
      "Chorizo"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956eb"
  },
  "id": "52938",
  "title": "Jamaican Beef Patties",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/wsqqsw1515364068.jpg",
  "instructions": [
    "Make the Pastry Dough  To a large bowl, add flour, 1 teaspoon salt, and turmeric and mix thoroughly. Rub shortening into flour until there are small pieces of shortening completely covered with flour. Pour in 1/2 cup of the ice water and mix with your hands to bring the dough together. Keep adding ice water 2 to 3 tablespoons at a time until the mixture forms a dough. At this stage, you can cut the dough into 2 large pieces, wrap in plastic and refrigerate for 30 minutes before using it. Alternatively, cut the dough into 10 to 12 equal pieces, place on a platter or baking sheet, cover securely with plastic wrap and let chill for 30 minutes while you make the filling. Make the Filling  Add ground beef to a large bowl. Sprinkle in allspice and black pepper. Mix together and set aside. Heat oil in a skillet until hot. Add onions and sauté until translucent. Add hot pepper, garlic and thyme and continue to sauté for another minute. Add 1/4 teaspoon salt. Add seasoned ground beef and toss to mix, breaking up any clumps, and let cook until the meat is no longer pink. Add ketchup and more salt to taste. Pour in 2 cups of water and stir. Bring the mixture to a boil then reduce heat and let simmer until most of the liquid has evaporated and whatever is remaining has reduced to a thick sauce. Fold in green onions. Remove from heat and let cool completely. Assemble the Patties  Beat the egg and water together to make an egg wash. Set aside. Now you can prepare the dough in two ways. First Method: Flour the work surface and rolling pin. If you had cut it into 2 large pieces, then take one of the large pieces and roll it out into a very large circle. Take a bowl with a wide rim (about 5 inches) and cut out three circles.  Place about 3 heaping tablespoons of the filling onto 1/2 of each circle. Dip a finger into the water and moisten the edges of the pastry. Fold over the other half and press to seal.   Take a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue to work until you have rolled all the dough and filled the patties. Second Method: If you had pre-cut the dough into individual pieces, work with one piece of dough at a time. Roll it out on a floured surface into a 5-inch circle or a little larger. Don’t worry if the edges are not perfect.  Place 3 heaping tablespoons of the filling on one side of the circle. Dip a finger into the water and moisten the edges of the pastry. Fold over the other half and press to seal.  Take a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue work until you have rolled all the dough and filled the patties.  Frying and Serving the Patties  After forming the patties, place the pans in the refrigerator while you heat the oven to 350 F. Just before adding the pans with the patties to the oven, brush the patties with egg wash. Bake patties for 30 minutes or until golden brown. Cool on wire racks. Serve warm."
  ],
  "ingredients": [
    [
      "4 cups ",
      "Plain Flour"
    ],
    [
      "1 tsp ",
      "Salt"
    ],
    [
      "1 tsp ",
      "Curry Powder"
    ],
    [
      "250g",
      "Butter"
    ],
    [
      "1 cup ",
      "Water"
    ],
    [
      "900g",
      "Minced Beef"
    ],
    [
      "1 tsp ",
      "Allspice"
    ],
    [
      "1/2 tsp",
      "Black Pepper"
    ],
    [
      "2 tbs",
      "Vegetable Oil"
    ],
    [
      "1 cup ",
      "Onions"
    ],
    [
      "Ground",
      "Red Pepper"
    ],
    [
      "2 tsp ground",
      "Garlic"
    ],
    [
      "1 tbs",
      "Thyme"
    ],
    [
      "1/4 tsp",
      "Salt"
    ],
    [
      "2 tbs",
      "Tomato Ketchup"
    ],
    [
      "2 cups ",
      "Water"
    ],
    [
      "1/2 cup ",
      "Onions"
    ],
    [
      "1 beaten",
      "Egg"
    ],
    [
      "1 tbs",
      "Water"
    ],
    [
      "1/4 cup",
      "Water"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956ed"
  },
  "id": "52781",
  "title": "Irish stew",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/sxxpst1468569714.jpg",
  "instructions": [
    "Heat the oven to 180C/350F/gas mark 4. Drain and rinse the soaked wheat, put it in a medium pan with lots of water, bring to a boil and simmer for an hour, until cooked. Drain and set aside.  Season the lamb with a teaspoon of salt and some black pepper. Put one tablespoon of oil in a large, deep sauté pan for which you have a lid; place on a medium-high heat. Add some of the lamb – don't overcrowd the pan – and sear for four minutes on all sides. Transfer to a bowl, and repeat with the remaining lamb, adding oil as needed.  Lower the heat to medium and add a tablespoon of oil to the pan. Add the shallots and fry for four minutes, until caramelised. Tip these into the lamb bowl, and repeat with the remaining vegetables until they are all nice and brown, adding more oil as you need it.  Once all the vegetables are seared and removed from the pan, add the wine along with the sugar, herbs, a teaspoon of salt and a good grind of black pepper. Boil on a high heat for about three minutes.  Tip the lamb, vegetables and whole wheat back into the pot, and add the stock. Cover and boil for five minutes, then transfer to the oven for an hour and a half.  Remove the stew from the oven and check the liquid; if there is a lot, remove the lid and boil for a few minutes."
  ],
  "ingredients": [
    [
      "300g soaked overnight in water",
      "whole wheat"
    ],
    [
      "2kg cut into 3cm cubes",
      "lamb loin chops"
    ],
    [
      "120ml",
      "olive oil"
    ],
    [
      "24 Skinned",
      "shallots"
    ],
    [
      "4 large",
      "carrots"
    ],
    [
      "2",
      "turnips"
    ],
    [
      "1",
      "celeriac"
    ],
    [
      "350g",
      "charlotte potatoes"
    ],
    [
      "150ml",
      "white wine"
    ],
    [
      "1 tsp",
      "caster sugar"
    ],
    [
      "4 sprigs",
      "fresh thyme"
    ],
    [
      "4 sprigs",
      "oregano"
    ],
    [
      "450ml",
      "chicken stock"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956ef"
  },
  "id": "52927",
  "title": "Montreal Smoked Meat",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
  "instructions": [
    "To make the cure, in a small bowl mix together salt, pink salt, black pepper, coriander, sugar, bay leaf, and cloves. Coat entire brisket with the cure and place in an extra-large resealable plastic bag. Place in the coldest part of the refrigerator and cure for 4 days, flipping brisket twice a day. Remove brisket from bag and wash as much cure off as possible under cold running water. Place brisket in a large container and fill with water and let soak for 2 hours, replacing water every 30 minutes. Remove from water and pat dry with paper towels. To make the rub, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red papper in a small bowl. Coat entire brisket with the rub. Fire up smoker or grill to 225 degrees, adding chunks of smoking wood chunks when at temperature. When wood is ignited and producing smoke, place brisket in, fat side up, and smoke until an instant read thermometer registers 165 degrees when inserted into thickest part of the brisket, about 6 hours. Transfer brisket to large roasting pan with V-rack. Place roasting pan over two burners on stovetop and fill with 1-inch of water. Bring water to a boil over high heat, reduce heat to medium, cover roasting pan with aluminum foil, and steam brisket until an instant read thermometer registers 180 degrees when inserted into thickest part of the meat, 1 to 2 hours, adding more hot water as needed. Transfer brisket to cutting board and let cool slightly. Slice and serve, preferably on rye with mustard."
  ],
  "ingredients": [
    [
      "1",
      "Beef Brisket"
    ],
    [
      "3 tbs",
      "Salt"
    ],
    [
      "3 tbs",
      "Black Pepper"
    ],
    [
      "1 tbs",
      "Coriander"
    ],
    [
      "1 tbs",
      "Sugar"
    ],
    [
      "1 tsp ",
      "Bay Leaf"
    ],
    [
      "1 tsp ",
      "Cloves"
    ],
    [
      "3 tbs",
      "Black Pepper"
    ],
    [
      "1 tbs",
      "Coriander"
    ],
    [
      "1 tbs",
      "Paprika"
    ],
    [
      "1 tbs",
      "Garlic"
    ],
    [
      "1 tbs",
      "Onion"
    ],
    [
      "1 tbs",
      "Dill"
    ],
    [
      "1 tsp ",
      "English Mustard"
    ],
    [
      "1 tbs",
      "Celery Salt"
    ],
    [
      "1 tsp ",
      "Red Pepper Flakes"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956f1"
  },
  "id": "52876",
  "title": "Minced Beef Pie",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/xwutvy1511555540.jpg",
  "instructions": [
    "Preheat the oven to 200C/400F/Gas 6. Heat the oil in a deep frying pan and fry the beef mince for 4-5 minutes, breaking it up with a wooden spoon as it browns. Add the onion and cook for 2-3 minutes, then stir in the tomato purée and cook for 2-3 more minutes. Stir in the flour and cook for a further minute, then add the chopped mushrooms, the stout or beef stock and a couple of dashes of Worcestershire sauce. Bring to the boil, then reduce the heat, cover the pan with a lid and leave to simmer for 20 minutes. Set aside and leave to cool, then turn the meat mixture into a one litre pie dish. Roll out the pastry on a floured work surface until it is slightly larger than the pie dish. Gently drape the pastry over the dish, pressing firmly onto the edges. Trim, then shape the edges into a fluted shape. Cut some leaf shapes out of the pastry trimmings and decorate the top of the pie, sticking them to the pastry with the beaten egg yolk. Make three or four slits in the pastry to allow the steam to escape, then brush the pie with the rest of the beaten egg yolk and bake in the oven for 20-25 minutes, or until golden-brown. To serve, slice into wedges."
  ],
  "ingredients": [
    [
      "2 tbs",
      "Vegetable Oil"
    ],
    [
      "500g",
      "Minced Beef"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "1 tbls",
      "Tomato Puree"
    ],
    [
      "1 ½ tbsp",
      "Plain Flour"
    ],
    [
      "75g",
      "Mushrooms"
    ],
    [
      "250ml",
      "Beef Stock"
    ],
    [
      "Dash",
      "Worcestershire Sauce"
    ],
    [
      "400g",
      "Shortcrust Pastry"
    ],
    [
      "1",
      "Egg Yolks"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956f3"
  },
  "id": "53052",
  "title": "Roti john",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/hx335q1619789561.jpg",
  "instructions": [
    "Mix all the ingredients in a bowl. Heat a pan or griddle with a little vegetable oil. Pour the mixture onto the pan and place a piece of open-faced baguette on top. Press on the bread with a spatula and grill for 2 minutes. Turn the bread over to make it a little crispy. Remove from pan and cut the bread into small portions. Add mayonnaise and/or Sambal before cutting the sandwich (optional)."
  ],
  "ingredients": [
    [
      "1/4 lb",
      "Minced Beef"
    ],
    [
      "1",
      "Onion"
    ],
    [
      "3",
      "Eggs"
    ],
    [
      "1 tbs",
      "Chilli"
    ],
    [
      "1/2 ",
      "Baguette"
    ],
    [
      "To taste",
      "Salt"
    ],
    [
      "To taste",
      "Pepper"
    ],
    [
      "Top",
      "Mayonnaise"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956f5"
  },
  "id": "53029",
  "title": "Mulukhiyah",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/x372ug1598733932.jpg",
  "instructions": [
    "Saute the onions in the 3-4 tablespoons olive oil Add the beef cubes or the chicken cutlets, sear for 3-4 min on each side Add 1 liter of water or just enough to cover the meat Cook over medium heat until the meat is done (I usually do this in the pressure cooker and press them for 5 min)  Add the frozen mulukhyia and stir until it thaws completely and then comes to a boil  In another pan add the 1/4 to 1/2 cup of olive oil and the cloves of garlic and cook over medium low heat until you can smell the garlic (don’t brown it, it will become bitter)  Add the oil and garlic to the mulukhyia and lower the heat and simmer for 5-10 minutes Add salt to taste  Serve with a generous amount of lemon juice.  You can serve it with some short grain rice or some pita bread"
  ],
  "ingredients": [
    [
      "800g",
      "Mulukhiyah"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "300g",
      "Beef"
    ],
    [
      "1 tsp ",
      "Salt"
    ],
    [
      "1 Litre",
      "Water"
    ],
    [
      "1",
      "Garlic Clove"
    ],
    [
      "1/2 cup ",
      "Olive Oil"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956f7"
  },
  "id": "53042",
  "title": "Portuguese prego with green piri-piri",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/ewcikl1614348364.jpg",
  "instructions": [
    "STEP 1  Rub the garlic over the steaks then put in a sandwich bag and tip in the olive oil, sherry vinegar and parsley stalks. Smoosh everything together, then use a rolling pin to bash the steaks a few times. Leave for 1-2 hours.  STEP 2  To make the sauce, put all the ingredients into a blender with 1 tbsp water and whizz until as smooth as possible. This will make more than you’ll need for the recipe but will keep for a week in an airtight jar.  STEP 3  Heat a griddle or frying pan to high. Brush away the garlic and parsley stalks from the steaks and season well. Sear the steaks for 2 minutes on each side then rest on a plate. Put the ciabatta halves onto the plate, toasted-side down, to soak up any juices.  STEP 4  Slice the steaks then stuff into the rolls with the green sauce and rocket."
  ],
  "ingredients": [
    [
      "1 clove",
      "Garlic"
    ],
    [
      "2 small",
      "Beef Fillet"
    ],
    [
      "2 tbs",
      "Olive Oil"
    ],
    [
      "1 tbs",
      "Vinegar"
    ],
    [
      "Leaves",
      "Parsley"
    ],
    [
      "2",
      "Ciabatta"
    ],
    [
      "2 handfulls",
      "Rocket"
    ],
    [
      "Small bunch",
      "Basil Leaves"
    ],
    [
      "Small bunch",
      "Parsley"
    ],
    [
      "1",
      "Jalapeno"
    ],
    [
      "1 tbs",
      "Vinegar"
    ],
    [
      "2 chopped",
      "Spring Onions"
    ],
    [
      "1/2 ",
      "Garlic"
    ],
    [
      "1/2 tsp",
      "Caster Sugar"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956f9"
  },
  "id": "53006",
  "title": "Moussaka",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg",
  "instructions": [
    "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning.  Stir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden."
  ],
  "ingredients": [
    [
      "500g",
      "Beef"
    ],
    [
      "1 large",
      "Aubergine"
    ],
    [
      "150g",
      "Greek Yogurt"
    ],
    [
      "1 beaten",
      "Egg"
    ],
    [
      "3 tbs",
      "Parmesan"
    ],
    [
      "400g",
      "Tomato"
    ],
    [
      "4 tbs",
      "Tomato Puree"
    ],
    [
      "350g",
      "Potatoes"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956fb"
  },
  "id": "52941",
  "title": "Red Peas Soup",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg",
  "instructions": [
    "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.  Have your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.  Time to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.  It’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.  Now is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.  Add them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.  You’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.  While this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day."
  ],
  "ingredients": [
    [
      "2 cups ",
      "Kidney Beans"
    ],
    [
      "1 large",
      "Carrots"
    ],
    [
      "2 chopped",
      "Spring Onions"
    ],
    [
      "4 sprigs",
      "Thyme"
    ],
    [
      "1 Diced",
      "Onion"
    ],
    [
      "1/2 tsp",
      "Black Pepper"
    ],
    [
      "2 chopped",
      "Red Pepper"
    ],
    [
      "4 Mashed",
      "Garlic Clove"
    ],
    [
      "1 tbs",
      "Allspice"
    ],
    [
      "2 Lbs",
      "Beef"
    ],
    [
      "2L",
      "Water"
    ],
    [
      "4",
      "Potatoes"
    ],
    [
      "1 cup ",
      "Plain Flour"
    ],
    [
      "1/4 cup",
      "Water"
    ],
    [
      "1 cup ",
      "Coconut Milk"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956fd"
  },
  "id": "52770",
  "title": "Spaghetti Bolognese",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/sutysw1468247559.jpg",
  "instructions": [
    "Put the onion and oil in a large pan and fry over a fairly high heat for 3-4 mins. Add the garlic and mince and fry until they both brown. Add the mushrooms and herbs, and cook for another couple of mins.  Stir in the tomatoes, beef stock, tomato ketchup or purée, Worcestershire sauce and seasoning. Bring to the boil, then reduce the heat, cover and simmer, stirring occasionally, for 30 mins.  Meanwhile, cook the spaghetti in a large pan of boiling, salted water, according to packet instructions. Drain well, run hot water through it, put it back in the pan and add a dash of olive oil, if you like, then stir in the meat sauce. Serve in hot bowls and hand round Parmesan cheese, for sprinkling on top."
  ],
  "ingredients": [
    [
      "2",
      "onions"
    ],
    [
      "1tbsp",
      "olive oil"
    ],
    [
      "1 clove",
      "garlic"
    ],
    [
      "500g",
      "lean minced beef"
    ],
    [
      "90g",
      "mushrooms"
    ],
    [
      "1tsp",
      "dried oregano"
    ],
    [
      "400g can",
      "tomatoes"
    ],
    [
      "300ml",
      "hot beef stock"
    ],
    [
      "1tbsp",
      "tomato puree"
    ],
    [
      "1tbsp",
      "worcestershire sauce"
    ],
    [
      "350g",
      "spaghetti"
    ],
    [
      "Topping",
      "parmesan"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d8d3ba309c7f6956ff"
  },
  "id": "53017",
  "title": "Paszteciki (Polish Pasties)",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/c9a3l31593261890.jpg",
  "instructions": [
    "Sift flour and salt into a large mixing bowl. Use a spoon to push the egg yolk through a fine sieve into the flour. Add the raw egg and mix well. Beat in butter 1 tablespoon at a time. Place dough on a floured surface and knead until smooth and elastic, then wrap in waxed paper and refrigerate until firm (at least 30 minutes). In a heavy skillet, melt 2 tablespoons butter over medium heat; saute the onion and rutabaga until the onion is soft and transparent (5 minutes). Put the onions, rutabaga, and beef through a meat grinder twice if you have one, if not just chop them up as fine as possible. Melt the remaining 4 tablespoons butter over medium heat, and add the meat mixture. Cook over low heat, stirring occasionally, until all of the liquid has evaporated and the mixture is thick enough to hold its shape. Remove from heat and let cool, then stir in 1 egg, and season with salt and pepper. Preheat oven to 350°F. On a lightly floured surface, roll the dough out into a 13x8\" rectangle (1/8\" thick). Spoon the filling down the center of the rectangle lengthwise, leaving about an inch of space on each end. Lightly brush the long sides with cold water, then fold one of the long sides over the filling and the other side over the top of that. Brush the short ends with cold water and fold them over the top, enclosing the filling. Place pastry seam side down on a baking sheet and brush the top evenly with the remaining scrambled egg. Bake in preheated oven until rich golden brown (30 minutes). Slice pastry diagonally into 1.5\" long pieces and serve as an appetizer or with soup."
  ],
  "ingredients": [
    [
      "1 cup ",
      "Flour"
    ],
    [
      "1/4 tsp",
      "Salt"
    ],
    [
      "1 Yolk",
      "Egg"
    ],
    [
      "1",
      "Egg"
    ],
    [
      "5 tbs",
      "Butter"
    ],
    [
      "6 tblsp",
      "Butter"
    ],
    [
      "1/3 cup",
      "Onion"
    ],
    [
      "1/2 cup ",
      "Swede"
    ],
    [
      "1/2 lb",
      "Beef Brisket"
    ],
    [
      "2 Beaten ",
      "Eggs"
    ],
    [
      "1 tsp ",
      "Salt"
    ],
    [
      "1/4 tsp",
      "Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695701"
  },
  "id": "52935",
  "title": "Steak Diane",
  "category": "Beef",
  "image": "https://www.themealdb.com/images/media/meals/vussxq1511882648.jpg",
  "instructions": [
    "Heat oil in a 12\" skillet over medium-high heat. Season steaks with salt and pepper, and add to skillet; cook, turning once, until browned on both sides and cooked to desired doneness, about 4 to 5 minutes for medium-rare. Transfer steaks to a plate, and set aside. Return skillet to high heat, and add stock; cook until reduced until to 1⁄2 cup, about 10 minutes. Pour into a bowl, and set aside. Return skillet to heat, and add butter; add garlic and shallots, and cook, stirring, until soft, about 2 minutes. Add mushrooms, and cook, stirring, until they release any liquid and it evaporates and mushrooms begin to brown, about 2 minutes. Add cognac, and light with a match to flambée; cook until flame dies down. Stir in reserved stock, cream, Dijon, Worcestershire, and hot sauce, and then return steaks to skillet; cook, turning in sauce, until warmed through and sauce is thickened, about 4 minutes. Transfer steak to serving plates and stir parsley and chives into sauce; pour sauce over steaks to serve."
  ],
  "ingredients": [
    [
      "2 tbs",
      "Canola Oil"
    ],
    [
      "4",
      "Beef Fillet"
    ],
    [
      "1 1/2 cup ",
      "Beef Stock"
    ],
    [
      "2 tbs",
      "Butter"
    ],
    [
      "2 cloves minced",
      "Garlic"
    ],
    [
      "1 medium finely diced",
      "Challots"
    ],
    [
      "4 oz ",
      "Mushrooms"
    ],
    [
      "¼ cup",
      "Brandy"
    ],
    [
      "¼ cup",
      "Heavy Cream"
    ],
    [
      "1 tbs",
      "Dijon Mustard"
    ],
    [
      "1 tbs",
      "Worcestershire Sauce"
    ],
    [
      "Dash",
      "Tabasco Sauce"
    ],
    [
      "1 tbs minced",
      "Parsley"
    ],
    [
      "1 tbs minced",
      "Chives"
    ],
    [
      "to taste",
      "Salt"
    ],
    [
      "to taste",
      "Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695703"
  },
  "id": "52990",
  "title": "Christmas cake",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/ldnrm91576791881.jpg",
  "instructions": [
    "Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.  Mix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.  Spoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months."
  ],
  "ingredients": [
    [
      "200g",
      "Butter"
    ],
    [
      "200g",
      "Muscovado Sugar"
    ],
    [
      "200g",
      "Plain Flour"
    ],
    [
      "4 Beaten",
      "Eggs"
    ],
    [
      "50g",
      "Ground Almonds"
    ],
    [
      "100ml",
      "Sherry"
    ],
    [
      "85g",
      "Candied Peel"
    ],
    [
      "85g",
      "Glace Cherry"
    ],
    [
      "250g",
      "Raisins"
    ],
    [
      "250g",
      "Currants"
    ],
    [
      "100g ",
      "Pecan Nuts"
    ],
    [
      "Grated zest of 1",
      "Lemon"
    ],
    [
      "1 ½ tbsp",
      "Mixed Spice"
    ],
    [
      "1 ½ tbsp",
      "Rose water"
    ],
    [
      "1/2 tsp",
      "Vanilla Extract"
    ],
    [
      "1/2 tsp",
      "Baking Powder"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695705"
  },
  "id": "52890",
  "title": "Jam Roly-Poly",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg",
  "instructions": [
    "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it. Tip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour. Tip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr. Let the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve."
  ],
  "ingredients": [
    [
      "50g",
      "Butter"
    ],
    [
      "250g",
      "Self-raising Flour"
    ],
    [
      "1 small",
      "Vanilla"
    ],
    [
      "50g",
      "Suet"
    ],
    [
      "150ml",
      "Milk"
    ],
    [
      "100g ",
      "Raspberry Jam"
    ],
    [
      "to serve",
      "Custard"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695707"
  },
  "id": "52787",
  "title": "Hot Chocolate Fudge",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/xrysxr1483568462.jpg",
  "instructions": [
    "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray. In a microwave-safe bowl, combine the dark chocolate chips, heavy cream and half of the sweetened condensed milk. Microwave the dark chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted. Add the vanilla extract to the dark chocolate mixture and stir well until smooth. Transfer the dark chocolate mixture into the prepared pan and spread into an even layer. In a separate bowl, combine the white chocolate chips with the remaining half of the sweetened condensed milk. Microwave the white chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted. Evenly spread the white chocolate mixture on top of dark chocolate layer. Top the chocolate layers with the Mallow Bits or miniature marshmallows, and gently press them down. Refrigerate for 4 hours, or until set. Remove the fudge and wax paper from the pan. Carefully peel all of the wax paper from the fudge. Cut the fudge into bite-sized pieces and serve."
  ],
  "ingredients": [
    [
      "2 cups",
      "Chocolate Chips"
    ],
    [
      "2 tbs",
      "Heavy Cream"
    ],
    [
      "1 – 14-ounce can",
      "Condensed Milk"
    ],
    [
      "1 tsp",
      "Vanilla Extract"
    ],
    [
      "1-⅓ cups",
      "White Chocolate Chips"
    ],
    [
      "1-½ cups",
      "Miniature Marshmallows"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695709"
  },
  "id": "52900",
  "title": "Madeira Cake",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/urtqut1511723591.jpg",
  "instructions": [
    "Pre-heat the oven to 180C/350F/Gas 4. Grease an 18cm/7in round cake tin, line the base with greaseproof paper and grease the paper. Cream the butter and sugar together in a bowl until pale and fluffy. Beat in the eggs, one at a time, beating the mixture well between each one and adding a tablespoon of the flour with the last egg to prevent the mixture curdling. Sift the flour and gently fold in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the lemon zest. Spoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown on top and a skewer inserted into the centre comes out clean. Remove from the oven and set aside to cool in the tin for 10 minutes, then turn it out on to a wire rack and leave to cool completely. To serve, decorate the cake with the candied peel."
  ],
  "ingredients": [
    [
      "175g",
      "Butter"
    ],
    [
      "175g",
      "Caster Sugar"
    ],
    [
      "3",
      "Eggs"
    ],
    [
      "250g",
      "Self-raising Flour"
    ],
    [
      "3 tbs",
      "Milk"
    ],
    [
      "Zest of 1",
      "Lemon"
    ],
    [
      "To Glaze",
      "Mixed Peel"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69570b"
  },
  "id": "52888",
  "title": "Eccles Cakes",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/wtqrqw1511639627.jpg",
  "instructions": [
    "To make the pastry, dice the butter and put it in the freezer to go really hard. Tip flour into the bowl of a food processor with half the butter and pulse to the texture of breadcrumbs. Pour in the lemon juice and 100ml iced water, and pulse to a dough. Tip in the rest of the butter and pulse a few times until the dough is heavily flecked with butter. It is important that you don’t overdo this as the flecks of butter are what makes the pastry flaky. On a floured surface roll the pastry out to a neat rectangle about 20 x 30cm. Fold the two ends of the pastry into the middle (See picture 1), then fold in half (pic 2). Roll the pastry out again and refold the same way 3 more times resting the pastry for at least 15 mins each time between roll and fold, then leave to rest in the fridge for at least 30 mins before using. To make the filling, melt the butter in a large saucepan. Take it off the heat and stir in all the other ingredients until completely mixed, then set aside. To make the cakes, roll the pastry out until it’s just a little thicker than a £1 coin and cut out 8 rounds about 12cm across. Re-roll the trimming if needed. Place a good heaped tablespoon of mixture in the middle of each round, brush the edges of the rounds with water, then gather the pastry around the filling and squeeze it together (pic 3). Flip them over so the smooth top is upwards and pat them into a smooth round. Flatten each round with a rolling pin to an oval until the fruit just starts to poke through, then place on a baking tray. Cut 2 little slits in each Eccles cakes, brush generously with egg white and sprinkle with the sugar (pic 4). Heat the oven to 220C/200C fan/gas 8. Bake the Eccles cakes for 15-20 mins until just past golden brown and sticky. Leave to cool on a rack and enjoy while still warm or cold with a cup of tea. If you prefer, Eccles cakes also go really well served with a wedge of hard, tangy British cheese such as Lancashire or cheddar."
  ],
  "ingredients": [
    [
      "250g",
      "Butter"
    ],
    [
      "350g",
      "Plain Flour"
    ],
    [
      "Juice of 1/2",
      "Lemon"
    ],
    [
      "25g",
      "Butter"
    ],
    [
      "200g",
      "Currants"
    ],
    [
      "50g",
      "Mixed Peel"
    ],
    [
      "100g ",
      "Muscovado Sugar"
    ],
    [
      "1 tsp ",
      "Cinnamon"
    ],
    [
      "1 tsp ",
      "Ginger"
    ],
    [
      "1 tsp ",
      "Allspice"
    ],
    [
      "Zest of 1",
      "Lemon"
    ],
    [
      "1 beaten",
      "Eggs"
    ],
    [
      "spinkling",
      "Sugar"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69570d"
  },
  "id": "52791",
  "title": "Eton Mess",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/uuxwvq1483907861.jpg",
  "instructions": [
    "Purée half the strawberries in a blender. Chop the remaining strawberries, reserving four for decoration. Whip the double cream until stiff peaks form, then fold in the strawberry purée and crushed meringue. Fold in the chopped strawberries and ginger cordial, if using. Spoon equal amounts of the mixture into four cold wine glasses. Serve garnished with the remaining strawberries and a sprig of mint."
  ],
  "ingredients": [
    [
      "500g",
      "strawberries"
    ],
    [
      "400ml",
      "double cream"
    ],
    [
      "3 x 7.5cm",
      "meringue nests"
    ],
    [
      "1 tbsp",
      "ginger cordial"
    ],
    [
      "sprigs of fresh",
      "Mint"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69570f"
  },
  "id": "52854",
  "title": "Pancakes",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/rwuyqx1511383174.jpg",
  "instructions": [
    "Put the flour, eggs, milk, 1 tbsp oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter. Set aside for 30 mins to rest if you have time, or start cooking straight away. Set a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper. When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go. Serve with lemon wedges and sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months."
  ],
  "ingredients": [
    [
      "100g ",
      "Flour"
    ],
    [
      "2 large",
      "Eggs"
    ],
    [
      "300ml ",
      "Milk"
    ],
    [
      "1 tbls",
      "Sunflower Oil"
    ],
    [
      "to serve",
      "Sugar"
    ],
    [
      "to serve",
      "Raspberries"
    ],
    [
      "to serve",
      "Blueberries"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695711"
  },
  "id": "52859",
  "title": "Key Lime Pie",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/qpqtuu1511386216.jpg",
  "instructions": [
    "Heat the oven to 160C/fan 140C/gas 3. Whizz the biscuits to crumbs in a food processor (or put in a strong plastic bag and bash with a rolling pin). Mix with the melted butter and press into the base and up the sides of a 22cm loose-based tart tin. Bake in the oven for 10 minutes. Remove and cool. Put the egg yolks in a large bowl and whisk for a minute with electric beaters. Add the condensed milk and whisk for 3 minutes then add the zest and juice and whisk again for 3 minutes. Pour the filling into the cooled base then put back in the oven for 15 minutes. Cool then chill for at least 3 hours or overnight if you like. When you are ready to serve, carefully remove the pie from the tin and put on a serving plate. To decorate, softly whip together the cream and icing sugar. Dollop or pipe the cream onto the top of the pie and finish with extra lime zest."
  ],
  "ingredients": [
    [
      "300g",
      "Digestive Biscuits"
    ],
    [
      "150g",
      "Butter"
    ],
    [
      "400g",
      "Condensed Milk"
    ],
    [
      "3",
      "Egg Yolks"
    ],
    [
      "4",
      "Lime"
    ],
    [
      "300ml ",
      "Double Cream"
    ],
    [
      "1 tbls",
      "Icing Sugar"
    ],
    [
      "to serve",
      "Lime"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695713"
  },
  "id": "53015",
  "title": "Krispy Kreme Donut",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/4i5cnx1587672171.jpg",
  "instructions": [
    "Dissolve yeast in warm water in 2 1/2-quart bowl. Add milk, sugar, salt, eggs, shortening and 2 cups flour. Beat on low for 30 seconds, scraping bowl constantly. Beat on medium speed for 2 minutes, scraping bowl occasionally. Stir in remaining flour until smooth. Cover and let rise until double, 50-60 minutes. (Dough is ready when indentation remains when touched.) Turn dough onto floured surface; roll around lightly to coat with flour. Gently roll dough 1/2-inch thick with floured rolling pin. Cut with floured doughnut cutter. Cover and let rise until double, 30-40 minutes. Heat vegetable oil in deep fryer to 350°. Slide doughnuts into hot oil with wide spatula. Turn doughnuts as they rise to the surface. Fry until golden brown, about 1 minute on each side. Remove carefully from oil (do not prick surface); drain. Dip the doughnuts into creamy glaze set on rack.   Glaze:  Heat butter until melted. Remove from heat. Stir in powdered sugar and vanilla until smooth. Stir in water, 1 tablespoon at a time, until desired consistency."
  ],
  "ingredients": [
    [
      "1/4 ounce",
      "Yeast"
    ],
    [
      "1/4 cup",
      "Water"
    ],
    [
      "1 1/2 cups ",
      "Water"
    ],
    [
      "1/2 cup ",
      "Sugar"
    ],
    [
      "1 tsp ",
      "Salt"
    ],
    [
      "2",
      "Eggs"
    ],
    [
      "1/3 cup",
      "Shortening"
    ],
    [
      "5 drops",
      "Flour"
    ],
    [
      "Sprinking",
      "Canola Oil"
    ],
    [
      "1/2 cup",
      "Milk"
    ],
    [
      "2 cups ",
      "Sugar"
    ],
    [
      "1 1/2 cups ",
      "Vanilla"
    ],
    [
      "6 tablespoons",
      "Boiling Water"
    ],
    [
      " 1/3 cup",
      "Butter"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695715"
  },
  "id": "52958",
  "title": "Peanut Butter Cookies",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/1544384070.jpg",
  "instructions": [
    "Preheat oven to 350ºF (180ºC). In a large bowl, mix together the peanut butter, sugar, and egg. Scoop out a spoonful of dough and roll it into a ball. Place the cookie balls onto a nonstick baking sheet. For extra decoration and to make them cook more evenly, flatten the cookie balls by pressing a fork down on top of them, then press it down again at a 90º angle to make a criss-cross pattern. Bake for 8-10 minutes or until the bottom of the cookies are golden brown. Remove from baking sheet and cool. Enjoy!"
  ],
  "ingredients": [
    [
      "1 cup ",
      "Peanut Butter"
    ],
    [
      "1/2 cup ",
      "Sugar"
    ],
    [
      "1",
      "Egg"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695717"
  },
  "id": "53022",
  "title": "Polskie Naleśniki (Polish Pancakes)",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/58bkyo1593350017.jpg",
  "instructions": [
    "Add flour, eggs, milk, water, and salt in a large bowl then mix with a hand mixer until you have a smooth, lump-free batter. At this point, mix in the butter or the vegetable oil. Alternatively, you can use them to grease the pan before frying each pancake. Heat a non-stick pan over medium heat, then pour in the batter, swirling the pan to help it spread. When the pancake starts pulling away a bit from the sides, and the top is no longer wet, flip it and cook shortly on the other side as well. Transfer to a plate. Cook the remaining batter until all used up. Serve warm, with the filling of your choice."
  ],
  "ingredients": [
    [
      "1 cup ",
      "Flour"
    ],
    [
      "2",
      "Eggs"
    ],
    [
      "1 cup ",
      "Milk"
    ],
    [
      "3/4 cup ",
      "Water"
    ],
    [
      "Pinch",
      "Salt"
    ],
    [
      "1 tsp ",
      "Sugar"
    ],
    [
      "3 tbs",
      "Butter"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695719"
  },
  "id": "52932",
  "title": "Pouding chomeur",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg",
  "instructions": [
    "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light. Add eggs and vanilla and mix. In another bowl, mix flour and baking powder. Alternate flour mix and milk to the butter mix. Pour into a 13 inch by 9 inch greased pan. MAPLE SAUCE. In a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir. Reduce heat and and gently cook 2 minutes or till sauce has reduced a little bit. Pour sauce gently over cake. Bake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean."
  ],
  "ingredients": [
    [
      "½ cup ",
      "Butter"
    ],
    [
      "1 cup ",
      "Sugar"
    ],
    [
      "2",
      "Eggs"
    ],
    [
      "1 tsp ",
      "Vanilla Extract"
    ],
    [
      "2 cups ",
      "Flour"
    ],
    [
      "1 tsp ",
      "Baking Powder"
    ],
    [
      "1 1/4 cup",
      "Milk"
    ],
    [
      "1 1/2 cup ",
      "Maple Syrup"
    ],
    [
      "1 1/2 cup ",
      "Brown Sugar"
    ],
    [
      "1 1/2 cup ",
      "Single Cream"
    ],
    [
      "1/3 cup",
      "Butter"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69571b"
  },
  "id": "52857",
  "title": "Pumpkin Pie",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/usuqtp1511385394.jpg",
  "instructions": [
    "Place the pumpkin in a large saucepan, cover with water and bring to the boil. Cover with a lid and simmer for 15 mins or until tender. Drain pumpkin; let cool. Heat oven to 180C/160C fan/gas 4. Roll out the pastry on a lightly floured surface and use it to line a 22cm loose-bottomed tart tin. Chill for 15 mins. Line the pastry with baking parchment and baking beans, then bake for 15 mins. Remove the beans and paper, and cook for a further 10 mins until the base is pale golden and biscuity. Remove from the oven and allow to cool slightly. Increase oven to 220C/200C fan/gas 7. Push the cooled pumpkin through a sieve into a large bowl. In a separate bowl, combine the sugar, salt, nutmeg and half the cinnamon. Mix in the beaten eggs, melted butter and milk, then add to the pumpkin purée and stir to combine. Pour into the tart shell and cook for 10 mins, then reduce the temperature to 180C/160C fan/gas 4. Continue to bake for 35-40 mins until the filling has just set. Leave to cool, then remove the pie from the tin. Mix the remaining cinnamon with the icing sugar and dust over the pie. Serve chilled."
  ],
  "ingredients": [
    [
      "750g",
      "Pumpkin"
    ],
    [
      "350g",
      "Shortcrust Pastry"
    ],
    [
      "Dusting",
      "Plain Flour"
    ],
    [
      "140g",
      "Caster Sugar"
    ],
    [
      "½ tsp",
      "Salt"
    ],
    [
      "½ tsp",
      "Nutmeg"
    ],
    [
      "1 tsp ",
      "Cinnamon"
    ],
    [
      "2 Beaten ",
      "Eggs"
    ],
    [
      "25g",
      "Butter"
    ],
    [
      "175g",
      "Milk"
    ],
    [
      "1 tblsp ",
      "Icing Sugar"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69571d"
  },
  "id": "52843",
  "title": "Lamb Tagine",
  "category": "Lamb",
  "image": "https://www.themealdb.com/images/media/meals/yuwtuu1511295751.jpg",
  "instructions": [
    "Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softened.  Add the diced lamb and brown all over. Stir in the garlic and all the spices and cook for a few mins more or until the aromas are released.  Add the honey and apricots, crumble in the stock cube and pour over roughly 500ml boiling water or enough to cover the meat. Give it a good stir and bring to the boil. Turn down to a simmer, put the lid on and cook for 1 hour.  Remove the lid and cook for a further 30 mins, then stir in the squash. Cook for 20 – 30 mins more until the squash is soft and the lamb is tender. Serve alongside rice or couscous and sprinkle with parsley and pine nuts, if using."
  ],
  "ingredients": [
    [
      "2 tblsp ",
      "Olive Oil"
    ],
    [
      "1 finely sliced",
      "Onion"
    ],
    [
      "2 chopped",
      "Carrots"
    ],
    [
      "500g",
      "Lamb Leg"
    ],
    [
      "2 cloves minced",
      "Garlic"
    ],
    [
      "½ tsp",
      "Cumin"
    ],
    [
      "½ tsp",
      "Ginger"
    ],
    [
      "¼ tsp",
      "Saffron"
    ],
    [
      "1 tsp ",
      "Cinnamon"
    ],
    [
      "1 tblsp ",
      "Honey"
    ],
    [
      "100g ",
      "Apricot"
    ],
    [
      "1",
      "Vegetable Stock Cube"
    ],
    [
      "1 medium chopped",
      "Butternut Squash"
    ],
    [
      "Steamed",
      "Couscous"
    ],
    [
      "Chopped",
      "Parsley"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69571f"
  },
  "id": "52808",
  "title": "Lamb Rogan josh",
  "category": "Lamb",
  "image": "https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg",
  "instructions": [
    " Put the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more. Tip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt. Cover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice."
  ],
  "ingredients": [
    [
      "2 quartered",
      "Onion"
    ],
    [
      "4 tbsp",
      "Sunflower Oil"
    ],
    [
      "4 cloves",
      "Garlic"
    ],
    [
      "Thumb sized peeled and very finely grated",
      "Ginger"
    ],
    [
      "2 tbsp",
      "Madras Paste"
    ],
    [
      "2 tsp",
      "Paprika"
    ],
    [
      "1",
      "cinnamon stick"
    ],
    [
      "6 bashed to break shells",
      "Cardamom"
    ],
    [
      "4",
      "Clove"
    ],
    [
      "2",
      "Bay Leaf"
    ],
    [
      "1 tbsp",
      "Tomato Purée"
    ],
    [
      "1kg cubed",
      "Lamb"
    ],
    [
      "150ml",
      "Greek yogurt"
    ],
    [
      "Garnish chopped ",
      "Coriander"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695721"
  },
  "id": "53046",
  "title": "Portuguese custard tarts",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/vmz7gl1614350221.jpg",
  "instructions": [
    "STEP 1 Roll the pastry Mix the flour and icing sugar, and use this to dust the work surface. Roll the pastry out to make a 45 x 30cm rectangle. Roll up lengthways to create a long sausage shape.  STEP 2 Cutting pastry into rounds Cut the pastry into 24 wheels, about 1-2cm thick.  STEP 3 Roll out each pastry portion Roll each wheel lightly with the rolling pin to fit 2 x 12-hole non-stick fairy cake tins.  STEP 4 Press pastry into the tin Press the pastry circles into the tins and mould into the tins to make thin cases. Chill until needed.  STEP 5 Make the infused syrup Heat the oven to 220C/fan 200C/gas 7. Make a sugar syrup by bringing the sugar, 200ml water, lemon zest and cinnamon stick to the boil. Reduce until syrupy, allow to cool, then remove the cinnamon and lemon. Whisk the eggs, egg yolks and cornflour until smooth in another large pan.  STEP 6 Making custard Heat the milk and vanilla pod seeds in a separate pan until just below the boil. Gradually pour the hot milk over the eggs and cornflour, then cook on a low heat, continually whisking.  STEP 7 Add syrup to custard Add the cooled sugar syrup to the custard and whisk until thickened slightly.  STEP 8 Pour custard into the tins Pour the custard through a sieve. Pour into the pastry cases and bake for 15 minutes until the pastry is golden and the custard has darkened.  STEP 9 cool and dust with icing sugar Cool completely in the tins then sift over icing sugar and ground cinnamon to serve.     "
  ],
  "ingredients": [
    [
      "2 tbs",
      "Plain Flour"
    ],
    [
      "2 tbs",
      "Icing Sugar"
    ],
    [
      "375g",
      "Puff Pastry"
    ],
    [
      "250g",
      "Caster Sugar"
    ],
    [
      "2 strips",
      "Lemon Zest"
    ],
    [
      "1 Stick",
      "Cinnamon"
    ],
    [
      "2",
      "Eggs"
    ],
    [
      "4",
      "Egg Yolks"
    ],
    [
      "50g",
      "Corn Flour"
    ],
    [
      "500ml",
      "Whole Milk"
    ],
    [
      "Pod of",
      "Vanilla"
    ],
    [
      "To serve",
      "Cinnamon"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695723"
  },
  "id": "52782",
  "title": "Lamb tomato and sweet spices",
  "category": "Lamb",
  "image": "https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg",
  "instructions": [
    "Use pickled vine leaves here, preserved in brine. Small delicate leaves are better than the large bristly ones but, if only large leaves are to hand, then trim them to roughly 12 by 12 cms so that you don't get too many layers of leaves around the filling. And remove any stalks. Drain the preserved leaves, immerse them in boiling water for 10 minutes and then leave to dry on a tea towel before use.  Basmati rice with butter and pine nuts is an ideal accompaniment. Couscous is great, too. Serves four. First make the filling. Put all the ingredients, apart from the tomatoes, in a bowl. Cut the tomatoes in half, coarsely grate into the bowl and discard the skins. Add half a teaspoon of salt and some black pepper, and stir. Leave on the side, or in the fridge, for up to a day. Before using, gently squeeze with your hands and drain away any juices that come out. To make the sauce, heat the oil in a medium pan. Add the ginger and garlic, cook for a minute or two, taking care not to burn them, then add the tomato, lemon juice and sugar. Season, and simmer for 20 minutes. While the sauce is bubbling away, prepare the vine leaves. Use any torn or broken leaves to line the base of a wide, heavy saucepan. Trim any leaves from the fennel, cut it vertically into 0.5cm-thick slices and spread over the base of the pan to cover completely. Lay a prepared vine leaf (see intro) on a work surface, veiny side up. Put two teaspoons of filling at the base of the leaf in a 2cm-long by 1cm-wide strip. Fold the sides of the leaf over the filling, then roll it tightly from bottom to top, in a cigar shape. Place in the pan, seam down, and repeat with the remaining leaves, placing them tightly next to each other in lines or circles (in two layers if necessary). Pour the sauce over the leaves (and, if needed, add water just to cover). Place a plate on top, to weigh the leaves down, then cover with a lid. Bring to a boil, reduce the heat and cook on a bare simmer for 70 minutes. Most of the liquid should evaporate. Remove from the heat, and leave to cool a little - they are best served warm. When serving, bring to the table in the pan - it looks great. Serve a few vine leaves and fennel slices with warm rice. Spoon the braising juices on top and garnish with coriander."
  ],
  "ingredients": [
    [
      "2 tbsp",
      "olive oil"
    ],
    [
      "4cm piece finely chopped",
      "ginger"
    ],
    [
      "2 cloves peeled and chopped",
      "garlic"
    ],
    [
      "800g peeled and chopped ",
      "tomatoes"
    ],
    [
      "2 tbsp",
      "lemon juice"
    ],
    [
      "1 tsp",
      "caster sugar"
    ],
    [
      "50",
      "vine leaves"
    ],
    [
      "1 large",
      "fennel bulb"
    ],
    [
      "400g",
      "lamb mince"
    ],
    [
      "1 medium",
      "onion"
    ],
    [
      "1 small peeled and coarsely grated",
      "potato"
    ],
    [
      "2 tbsp",
      "basmati rice"
    ],
    [
      "2 tbsp",
      "chopped parsley"
    ],
    [
      "2 tbsp chopped",
      "coriander"
    ],
    [
      "1 tbsp",
      "lemon juice"
    ],
    [
      "2 cloves",
      "garlic"
    ],
    [
      "½ tsp ground",
      "clove"
    ],
    [
      "½ tsp ground ",
      "cinnamon"
    ],
    [
      "2 medium",
      "tomatoes"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695725"
  },
  "id": "52995",
  "title": "BBQ Pork Sloppy Joes",
  "category": "Pork",
  "image": "https://www.themealdb.com/images/media/meals/atd5sh1583188467.jpg",
  "instructions": [
    "1  Preheat oven to 450 degrees. Wash and dry all produce. Cut sweet potatoes into ½-inch-thick wedges. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 20-25 minutes.  2  Meanwhile, halve and peel onion. Slice as thinly as possible until you have ¼ cup (½ cup for 4 servings); finely chop remaining onion. Peel and finely chop garlic. Halve lime; squeeze juice into a small bowl. Halve buns. Add 1 TBSP butter (2 TBSP for 4) to a separate small microwave-safe bowl; microwave until melted, 30 seconds. Brush onto cut sides of buns.  3  To bowl with lime juice, add sliced onion, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. Stir to combine; set aside to quick-pickle.  4  Heat a drizzle of oil in a large pan over medium-high heat. Add chopped onion and season with salt and pepper. Cook, stirring, until softened, 4-5 minutes. Add garlic and cook until fragrant, 30 seconds more. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes.  5  While pork cooks, in a third small bowl, combine BBQ sauce, pickling liquid from onion, 3 TBSP ketchup (6 TBSP for 4 servings), ½ tsp sugar (1 tsp for 4), and ¼ cup water (⅓ cup for 4). Once pork is cooked through, add BBQ sauce mixture to pan. Cook, stirring, until sauce is thickened, 2-3 minutes. Taste and season with salt and pepper.  6  Meanwhile, toast buns in oven or toaster oven until golden, 3-5 minutes. Divide toasted buns between plates and fill with as much BBQ pork as you’d like. Top with pickled onion and hot sauce. Serve with sweet potato wedges on the side."
  ],
  "ingredients": [
    [
      "2",
      "Potatoes"
    ],
    [
      "1",
      "Red Onions"
    ],
    [
      "2 cloves",
      "Garlic"
    ],
    [
      "1",
      "Lime"
    ],
    [
      "2",
      "Bread"
    ],
    [
      "1 lb",
      "Pork"
    ],
    [
      "Barbeque Sauce"
    ],
    [
      "Hotsauce"
    ],
    [
      "Tomato Ketchup"
    ],
    [
      "Sugar"
    ],
    [
      "Vegetable Oil"
    ],
    [
      "Salt"
    ],
    [
      "Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695727"
  },
  "id": "52838",
  "title": "Venetian Duck Ragu",
  "category": "Pasta",
  "image": "https://www.themealdb.com/images/media/meals/qvrwpt1511181864.jpg",
  "instructions": [
    "Heat the oil in a large pan. Add the duck legs and brown on all sides for about 10 mins. Remove to a plate and set aside. Add the onions to the pan and cook for 5 mins until softened. Add the garlic and cook for a further 1 min, then stir in the cinnamon and flour and cook for a further min. Return the duck to the pan, add the wine, tomatoes, stock, herbs, sugar and seasoning. Bring to a simmer, then lower the heat, cover with a lid and cook for 2 hrs, stirring every now and then. Carefully lift the duck legs out of the sauce and place on a plate – they will be very tender so try not to lose any of the meat. Pull off and discard the fat, then shred the meat with 2 forks and discard the bones. Add the meat back to the sauce with the milk and simmer, uncovered, for a further 10-15 mins while you cook the pasta. Cook the pasta following pack instructions, then drain, reserving a cup of the pasta water, and add the pasta to the ragu. Stir to coat all the pasta in the sauce and cook for 1 min more, adding a splash of cooking liquid if it looks dry. Serve with grated Parmesan, if you like."
  ],
  "ingredients": [
    [
      "1 tbls",
      "Olive Oil"
    ],
    [
      "4",
      "Duck Legs"
    ],
    [
      "2 finely chopped",
      "Onions"
    ],
    [
      "2 cloves minced",
      "Garlic"
    ],
    [
      "2 tsp ground",
      "Cinnamon"
    ],
    [
      "2 tsp",
      "Plain Flour"
    ],
    [
      "250ml",
      "Red Wine"
    ],
    [
      "800g",
      "Chopped Tomatoes"
    ],
    [
      "1",
      "Chicken Stock Cube"
    ],
    [
      "3 sprigs",
      "Rosemary"
    ],
    [
      "2",
      "Bay Leaves"
    ],
    [
      "1 tsp ",
      "Sugar"
    ],
    [
      "2 tbs",
      "Milk"
    ],
    [
      "600g",
      "Paccheri Pasta"
    ],
    [
      "Grated",
      "Parmesan Cheese"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695729"
  },
  "id": "53037",
  "title": "Coddled pork with cider",
  "category": "Pork",
  "image": "https://www.themealdb.com/images/media/meals/7vpsfp1608588991.jpg",
  "instructions": [
    "STEP 1 Heat the butter in a casserole dish until sizzling, then fry the pork for 2-3 mins on each side until browned. Remove from the pan.  STEP 2 Tip the bacon, carrot, potatoes and swede into the pan, then gently fry until slightly coloured. Stir in the cabbage, sit the chops back on top, add the bay leaf, then pour over the cider and stock. Cover the pan, then leave everything to gently simmer for 20 mins until the pork is cooked through and the vegetables are tender.  STEP 3 Serve at the table spooned straight from the dish."
  ],
  "ingredients": [
    [
      "Knob",
      "Butter"
    ],
    [
      "2",
      "Pork Chops"
    ],
    [
      "4",
      "Bacon"
    ],
    [
      "2",
      "Potatoes"
    ],
    [
      "1",
      "Carrots"
    ],
    [
      "1/2 ",
      "Swede"
    ],
    [
      "1/2 ",
      "Cabbage"
    ],
    [
      "1",
      "Bay Leaf"
    ],
    [
      "100ml",
      "Cider"
    ],
    [
      "100g ",
      "Chicken Stock"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69572b"
  },
  "id": "52885",
  "title": " Bubble & Squeak",
  "category": "Pork",
  "image": "https://www.themealdb.com/images/media/meals/xusqvw1511638311.jpg",
  "instructions": [
    "Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins. Next, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve."
  ],
  "ingredients": [
    [
      "1 tbs",
      "Butter"
    ],
    [
      "4",
      "Bacon"
    ],
    [
      "1 finely sliced",
      "Onion"
    ],
    [
      "1 chopped",
      "Garlic Clove"
    ],
    [
      "20",
      "Brussels Sprouts"
    ],
    [
      "400g",
      "Potatoes"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69572d"
  },
  "id": "52773",
  "title": "Honey Teriyaki Salmon",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/xxyupu1468262513.jpg",
  "instructions": [
    "Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.  Heat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.  Garnish with sesame and serve immediately."
  ],
  "ingredients": [
    [
      "1 lb",
      "Salmon"
    ],
    [
      "1 tablespoon",
      "Olive oil"
    ],
    [
      "2 tablespoons",
      "Soy Sauce"
    ],
    [
      "2 tablespoons",
      "Sake"
    ],
    [
      "4 tablespoons",
      "Sesame Seed"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69572f"
  },
  "id": "52764",
  "title": "Garides Saganaki",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/wuvryu1468232995.jpg",
  "instructions": [
    "Place the prawns in a pot and add enough water to cover. Boil for 5 minutes. Drain, reserving the liquid, and set aside. Heat 2 tablespoons of oil in a saucepan. Add the onion; cook and stir until soft. Mix in the parsley, wine, tomatoes, garlic and remaining olive oil. Simmer, stirring occasionally, for about 30 minutes, or until the sauce is thickened. While the sauce is simmering, the prawns should become cool enough to handle. First remove the legs by pinching them, and then pull off the shells, leaving the head and tail on. When the sauce has thickened, stir in the prawns. Bring to a simmer again if the sauce has cooled with the prawns, and cook for about 5 minutes. Add the feta and remove from the heat. Let stand until the cheese starts to melt. Serve warm with slices of crusty bread. Though completely untraditional, you can add a few tablespoons of stock or passata to this recipe to make a delicious pasta sauce. Toss with pasta after adding the feta, and serve."
  ],
  "ingredients": [
    [
      "500g",
      "Raw king prawns"
    ],
    [
      "3 tablespoons",
      "Olive oil"
    ],
    [
      "1",
      "Chopped onion"
    ],
    [
      "pinch",
      "Freshly chopped parsley"
    ],
    [
      "250ml",
      "White wine"
    ],
    [
      "1 (400g) tin",
      "Chopped tomatoes"
    ],
    [
      "1/2 teaspoon",
      "Minced garlic"
    ],
    [
      "1 (200g) pack",
      "Cubed Feta cheese"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695731"
  },
  "id": "52777",
  "title": "Mediterranean Pasta Salad",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/wvqpwt1468339226.jpg",
  "instructions": [
    "Bring a large saucepan of salted water to the boil Add the pasta, stir once and cook for about 10 minutes or as directed on the packet. Meanwhile, wash the tomatoes and cut into quarters. Slice the olives. Wash the basil. Put the tomatoes into a salad bowl and tear the basil leaves over them. Add a tablespoon of olive oil and mix. When the pasta is ready, drain into a colander and run cold water over it to cool it quickly. Toss the pasta into the salad bowl with the tomatoes and basil. Add the sliced olives, drained mozzarella balls, and chunks of tuna. Mix well and let the salad rest for at least half an hour to allow the flavours to mingle. Sprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving."
  ],
  "ingredients": [
    [
      "200 g",
      "mozzarella balls"
    ],
    [
      "250 g",
      "baby plum tomatoes"
    ],
    [
      "1  bunch",
      "fresh basil"
    ],
    [
      "350 g",
      "farfalle"
    ],
    [
      "3  tablespoons",
      "extra virgin olive oil"
    ],
    [
      "40 g",
      "Green Olives"
    ],
    [
      "200 g",
      "tuna"
    ],
    [
      "to taste",
      "salt"
    ],
    [
      "to taste",
      "pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695733"
  },
  "id": "52847",
  "title": "Pork Cassoulet",
  "category": "Pork",
  "image": "https://www.themealdb.com/images/media/meals/wxuvuv1511299147.jpg",
  "instructions": [
    "Heat oven to 140C/120C fan/gas 1. Put a large ovenproof pan (with a tight-fitting lid) on a high heat. Add your fat and diced meat, cook for a few mins to seal the edges, giving it a quick stir to cook evenly. Reduce the heat to low, add the sliced onion, whole garlic cloves, carrot and fennel seeds, and cook gently to soften the veg for a few mins. Pour over the red wine vinegar, scraping any meaty bits off the bottom of the pan. Add the stock, tomato purée, and half the rosemary and parsley. Bring to the boil and simmer for 10 mins, then season, cover with a lid and put into the oven for 2 hrs, removing the lid for the final hour of cooking. Stir occasionally and add the beans with 30 mins to go. Remove the pan from the oven and heat the grill. Scatter the top with the remaining herbs and breadcrumbs, drizzle a little oil over the top, and return to the oven for 5-10 mins, until the breadcrumbs are golden. Serve with crusty bread and green veg."
  ],
  "ingredients": [
    [
      "4 tbsp",
      "Goose Fat"
    ],
    [
      "350g",
      "Pork"
    ],
    [
      "1 large",
      "Onion"
    ],
    [
      "10",
      "Garlic"
    ],
    [
      "1 thinly sliced",
      "Carrots"
    ],
    [
      "1 tsp ",
      "Fennel Seeds"
    ],
    [
      "2 tblsp ",
      "Red Wine Vinegar"
    ],
    [
      "600ml",
      "Vegetable Stock"
    ],
    [
      "1 tblsp ",
      "Tomato Puree"
    ],
    [
      "2 sticks",
      "Rosemary"
    ],
    [
      "Handful",
      "Parsley"
    ],
    [
      "400g",
      "Haricot Beans"
    ],
    [
      "2 tblsp ",
      "Breadcrumbs"
    ],
    [
      "drizzle",
      "Oil"
    ],
    [
      "to serve",
      "Bread"
    ],
    [
      "to serve",
      "Broccoli"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695735"
  },
  "id": "52887",
  "title": "Kedgeree",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/utxqpt1511639216.jpg",
  "instructions": [
    "For the rice, heat the oil in a large, lidded pan, add the onion, then gently fry for 5 mins until softened but not coloured. Add the spices, season with salt, then continue to fry until the mix start to go brown and fragrant; about 3 mins. Add the rice and stir in well. Add 600ml water, stir, then bring to the boil. Reduce to a simmer, then cover for 10 mins. Take off the heat and leave to stand, covered, for 10-15 mins more. The rice will be perfectly cooked if you do not lift the lid before the end of the cooking. Meanwhile, put the haddock and bay leaves in a frying pan, cover with the milk, then poach for 10 mins until the flesh flakes. Remove from the milk, peel away the skin, then flake the flesh into thumbsize pieces. Place the eggs in a pan, cover with water, bring to the boil, then reduce to a simmer. Leave for 4½-5 mins, plunge into cold water, then peel and cut the eggs into quarters. Gently mix the fish, eggs, parsley, coriander and rice together in the pan. Serve hot, sprinkled with a few extra herbs."
  ],
  "ingredients": [
    [
      "300g",
      "Smoked Haddock"
    ],
    [
      "2",
      "Bay Leaves"
    ],
    [
      "300ml ",
      "Milk"
    ],
    [
      "4",
      "Eggs"
    ],
    [
      "Handful",
      "Parsley"
    ],
    [
      "Handful",
      "Coriander"
    ],
    [
      "2 tbs",
      "Vegetable Oil"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "1 tsp ",
      "Coriander"
    ],
    [
      "2 tsp",
      "Curry Powder"
    ],
    [
      "300g",
      "Rice"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695737"
  },
  "id": "53051",
  "title": "Nasi lemak",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/wai9bw1619788844.jpg",
  "instructions": [
    "In a medium saucepan over medium heat, stir together coconut milk, water, ground ginger, ginger root, salt, bay leaf, and rice. Cover, and bring to a boil. Reduce heat, and simmer for 20 to 30 minutes, or until done.   Step 2 Place eggs in a saucepan, and cover with cold water. Bring water to a boil, and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove eggs from hot water, cool, peel and slice in half. Slice cucumber.   Step 3 Meanwhile, in a large skillet or wok, heat 1 cup vegetable oil over medium-high heat. Stir in peanuts and cook briefly, until lightly browned. Remove peanuts with a slotted spoon and place on paper towels to soak up excess grease. Return skillet to stove. Stir in the contents of one package anchovies; cook briefly, turning, until crisp. Remove with a slotted spoon and place on paper towels. Discard oil. Wipe out skillet.   Step 4 Heat 2 tablespoons oil in the skillet. Stir in the onion, garlic, and shallots; cook until fragrant, about 1 or 2 minutes. Mix in the chile paste, and cook for 10 minutes, stirring occasionally. If the chile paste is too dry, add a small amount of water. Stir in remaining anchovies; cook for 5 minutes. Stir in salt, sugar, and tamarind juice; simmer until sauce is thick, about 5 minutes.   Step 5 Serve the onion and garlic sauce over the warm rice, and top with peanuts, fried anchovies, cucumbers, and eggs."
  ],
  "ingredients": [
    [
      "2 cups ",
      "Coconut Milk"
    ],
    [
      "2 cups ",
      "Water"
    ],
    [
      "1/4 tsp",
      "Ginger Paste"
    ],
    [
      "1",
      "Ginger"
    ],
    [
      "1",
      "Bay Leaf"
    ],
    [
      "2 cups ",
      "Rice"
    ],
    [
      "4",
      "Eggs"
    ],
    [
      "1",
      "Cucumber"
    ],
    [
      "1 cup ",
      "Peanuts"
    ],
    [
      "4 oz ",
      "Anchovy Fillet"
    ],
    [
      "2 tbs",
      "Vegetable Oil"
    ],
    [
      "1",
      "Onion"
    ],
    [
      "3 cloves",
      "Garlic"
    ],
    [
      "3",
      "Shallots"
    ],
    [
      "2 tsp",
      "Chilli Powder"
    ],
    [
      "4 oz ",
      "Anchovy Fillet"
    ],
    [
      "3 tbs",
      "Sugar"
    ],
    [
      "1/3 cup",
      "Tamarind Paste"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695739"
  },
  "id": "52946",
  "title": "Kung Po Prawns",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/1525873040.jpg",
  "instructions": [
    "Mix the cornflour and 1 tbsp soy sauce, toss in the prawns and set aside for 10 mins. Stir the vinegar, remaining soy sauce, tomato purée, sugar and 2 tbsp water together to make a sauce.  When you’re ready to cook, heat a large frying pan or wok until very hot, then add 1 tbsp oil. Fry the prawns until they are golden in places and have opened out– then tip them out of the pan.  Heat the remaining oil and add the peanuts, chillies and water chestnuts. Stir-fry for 2 mins or until the peanuts start to colour, then add the ginger and garlic and fry for 1 more min. Tip in the prawns and sauce and simmer for 2 mins until thickened slightly. Serve with rice."
  ],
  "ingredients": [
    [
      "400g",
      "Prawns"
    ],
    [
      "2 tbs",
      "Soy Sauce"
    ],
    [
      "1 tsp ",
      "Tomato Puree"
    ],
    [
      "1 tsp ",
      "Corn Flour"
    ],
    [
      "1 tsp ",
      "Caster Sugar"
    ],
    [
      "1 tsp ",
      "Sunflower Oil"
    ],
    [
      "85g",
      "Peanuts"
    ],
    [
      "3 Large",
      "Chilli"
    ],
    [
      "1 tbs",
      "Brown Sugar"
    ],
    [
      "6 cloves",
      "Garlic Clove"
    ],
    [
      "450g",
      "Water Chestnut"
    ],
    [
      "to taste",
      "Ginger"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69573b"
  },
  "id": "52821",
  "title": "Laksa King Prawn Noodles",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/rvypwy1503069308.jpg",
  "instructions": [
    "Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir and cook for 1 min more. Dissolve the stock cube in a large jug in 700ml boiling water, then pour into the pan and stir to combine. Tip in the coconut milk and bring to the boil. Add the fish sauce and a little seasoning. Toss in the noodles and cook for a further 3-4 mins until softening. Squeeze in the lime juice, add the prawns and cook through until warm, about 2-3 mins. Scatter over some of the coriander. Serve in bowls with the remaining coriander and lime wedges on top for squeezing over."
  ],
  "ingredients": [
    [
      "1 tbsp",
      "Olive Oil"
    ],
    [
      "1 finely sliced",
      "red chili"
    ],
    [
      "2 ½ tbsp",
      "Thai red curry paste"
    ],
    [
      "1",
      "vegetable stock cube"
    ],
    [
      "400ml can",
      "coconut milk"
    ],
    [
      "2 tsp",
      "fish sauce"
    ],
    [
      "100g",
      "rice noodles"
    ],
    [
      "2 juice of 1, the other halved",
      "lime"
    ],
    [
      "150g",
      "king prawns"
    ],
    [
      "½ small pack",
      "coriander"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69573d"
  },
  "id": "52809",
  "title": "Recheado Masala Fish",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg",
  "instructions": [
    "Soak all the spices, ginger, garlic, tamarind pulp and kashmiri chilies except oil in vinegar. Add sugar and salt. Also add turmeric powder. Combine all nicely and marinate for 35-40 mins. Grind the mixture until soft and smooth. Add more vinegar if required but ensure the paste has to be thick so add vinegar accordingly. If the masala paste is thin then it would not stick to the fish. Rinse the fish slit from the center and give some incision from the top. You could see the fish below for clarity. Now stuff the paste into the center and into the incision. Coat the entire fish with this paste. Marinate the fish for 30 mins. Place oil in a shallow pan, once oil is quite hot shallow fry the stuffed mackerels. Fry until golden brown from both sides Serve the recheado mackerels hot with salad, lime wedges, rice and curry. Notes 1. Ensure the masala paste is thick else the result won't be good. 2. If you aren't able to find kashmiri chilies then use bedgi chilies or kashmiri red chili powder. 3. You could use white vinegar or coconut vinegar. 4. Any left over paste could be stored in the fridge for future use. 5. Cinnamon could be avoided as it's a strong spice used generally for meat or chicken."
  ],
  "ingredients": [
    [
      "4",
      "Mackerel"
    ],
    [
      "18 dried",
      "Red Chili"
    ],
    [
      "1 inch",
      "Ginger"
    ],
    [
      "8 cloves",
      "Garlic"
    ],
    [
      "1.5 tsp",
      "Pepper"
    ],
    [
      "1 tsp",
      "Cumin"
    ],
    [
      "½ tsp",
      "Turmeric"
    ],
    [
      "Cinnamon stick"
    ],
    [
      "4",
      "Clove"
    ],
    [
      "2",
      "Cardamom"
    ],
    [
      "1 tbsp",
      "Sugar"
    ],
    [
      "2 marble sized",
      "Tamarind ball"
    ],
    [
      "2.5 tbsp",
      "Vinegar"
    ],
    [
      "for frying",
      "Oil"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69573f"
  },
  "id": "53040",
  "title": "Spring onion and prawn empanadas",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/1c5oso1614347493.jpg",
  "instructions": [
    "STEP 1  To make the dough, rub the butter into the flour and then add the egg white and half the yolk (keep the rest), vinegar, a pinch of salt and enough cold water to make a soft dough. Knead on a floured surface until smooth and then wrap and rest for 30 minutes.  STEP 2  Heat the oven to 180c/fan 160c/gas 4. Trim the green ends of the spring onions and then finely slice the rest. Heat a little oil in a pan and fry them gently until soft but not browned. Add the chilli and garlic, stir and then add the prawns and cook until they are opaque. Season well. Scoop out the prawns and bubble the juices until they thicken, then add back the prawns.  STEP 3  Divide the empanada dough into eight balls and roll out to thin circles on a floured surface. Put some filling on one half of the dough, sprinkle the feta on top and fold the other half over. Trim the edge and then fold and crimp the dough together so the empanada is tightly sealed, put it on an oiled baking sheet either on its side or sitting on its un-crimped edge like a cornish pasty. Repeat with the remaining dough and mixture. Mix the leftover egg yolk with a splash of water and brush the top of the empanadas.  STEP 4  Bake for 30 minutes or until golden and slightly crisp around the edges."
  ],
  "ingredients": [
    [
      "1  bunch",
      "Spring Onions"
    ],
    [
      "Dash",
      "Olive Oil"
    ],
    [
      "1 finely sliced",
      "Red Chilli"
    ],
    [
      "1 clove",
      "Garlic"
    ],
    [
      "350g",
      "Prawns"
    ],
    [
      "75g",
      "Feta"
    ],
    [
      "15g",
      "Butter"
    ],
    [
      "250g",
      "Plain Flour"
    ],
    [
      "1 Seperated",
      "Egg"
    ],
    [
      "1/2 tsp",
      "White Wine Vinegar"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695741"
  },
  "id": "52936",
  "title": "Saltfish and Ackee",
  "category": "Seafood",
  "image": "https://www.themealdb.com/images/media/meals/vytypy1511883765.jpg",
  "instructions": [
    "For the saltfish, soak the salt cod overnight, changing the water a couple of times. Drain, then put the cod in a large pan of fresh water and bring to the boil. Drain again, add fresh water and bring to the boil again. Simmer for about five minutes, or until cooked through, then drain and flake the fish into large pieces. Discard any skin or bones. For the dumplings, mix the flour and suet with a pinch of salt and 250ml/9fl oz water to make a dough. Wrap the mixture in clingfilm and leave in the fridge to rest. Open the can of ackee, drain and rinse, then set aside. Heat a tablespoon of olive oil in a pan and fry the onion until softened but not brown. Add the spices, seasoning, pepper sauce and sliced peppers and continue to fry until the peppers are tender. Add the chopped tomatoes, then the salt cod and mix together. Lastly stir in the ackee very gently and leave to simmer until ready to serve. When you’re almost ready to eat, heat about 1cm/½in vegetable oil in a frying pan and heat until just smoking. Shape the dumpling mix into plum-size balls and shallow-fry until golden-brown. (CAUTION: hot oil can be dangerous. Do not leave the pan unattended.) Drain the dumplings on kitchen paper and serve with the saltfish and ackee."
  ],
  "ingredients": [
    [
      "450g",
      "Salt Cod"
    ],
    [
      "400g",
      "Ackee"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "1 tsp ",
      "Paprika"
    ],
    [
      "2 tsp",
      "Curry Powder"
    ],
    [
      "2 tsp",
      "Jerusalem Artichokes"
    ],
    [
      "1 tsp ",
      "Hotsauce"
    ],
    [
      "1 sliced",
      "Red Pepper"
    ],
    [
      "1 sliced",
      "Yellow Pepper"
    ],
    [
      "200g",
      "Tomatoes"
    ],
    [
      "to taste",
      "Salt"
    ],
    [
      "to taste",
      "Pepper"
    ],
    [
      "250g",
      "Self-raising Flour"
    ],
    [
      "30g",
      "Suet"
    ],
    [
      "pinch",
      "Salt"
    ],
    [
      "for frying",
      "Olive Oil"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695743"
  },
  "id": "53016",
  "title": "Chick-Fil-A Sandwich",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/sbx7n71587673021.jpg",
  "instructions": [
    "Wrap the chicken loosely between plastic wrap and pound gently with the flat side of a meat tenderizer until about 1/2 inch thick all around. Cut into two pieces, as even as possible. Marinate in the pickle juice for 30 minutes to one hour (add a teaspoon of Tabasco sauce now for a spicy sandwich). Beat the egg with the milk in a bowl. Combine the flour, sugar, and spices in another bowl. Dip the chicken pieces each into the egg on both sides, then coat in flour on both sides. Heat the oil in a skillet (1/2 inch deep) to about 345-350. Fry each cutlet for 2 minutes on each side, or until golden and cooked through. Blot on paper and serve on toasted buns with pickle slices."
  ],
  "ingredients": [
    [
      "1",
      "Chicken Breast"
    ],
    [
      "1/4 cup",
      "Pickle Juice"
    ],
    [
      "1",
      "Egg"
    ],
    [
      "1/4 cup",
      "Milk"
    ],
    [
      "1/2 cup ",
      "Flour"
    ],
    [
      "1 tbs",
      "Icing Sugar"
    ],
    [
      "1/2 tsp",
      "Paprika"
    ],
    [
      "1/2 tsp",
      "Salt"
    ],
    [
      "1/4 tsp",
      "Black Pepper"
    ],
    [
      "1/4 tsp",
      "Garlic Powder"
    ],
    [
      "1/4 tsp",
      "Celery Salt"
    ],
    [
      "1/2 tsp",
      "Cayenne Pepper"
    ],
    [
      "1 cup ",
      "Olive Oil"
    ],
    [
      "1",
      "Sesame Seed Burger Buns"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695745"
  },
  "id": "52796",
  "title": "Chicken Alfredo Primavera",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg",
  "instructions": [
    "Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. "
  ],
  "ingredients": [
    [
      "2 tablespoons",
      "Butter"
    ],
    [
      "3 tablespoons",
      "Olive Oil"
    ],
    [
      "5 boneless",
      "Chicken"
    ],
    [
      "1 teaspoon",
      "Salt"
    ],
    [
      "1 cut into 1/2-inch cubes",
      "Squash"
    ],
    [
      "1 Head chopped",
      "Broccoli"
    ],
    [
      "8-ounce sliced",
      "mushrooms"
    ],
    [
      "1 red",
      "Pepper"
    ],
    [
      "1 chopped",
      "onion"
    ],
    [
      "3 cloves",
      "garlic"
    ],
    [
      "1/2 teaspoon",
      "red pepper flakes"
    ],
    [
      "1/2 cup",
      "white wine"
    ],
    [
      "1/2 cup",
      "milk"
    ],
    [
      "1/2 cup",
      "heavy cream"
    ],
    [
      "1 cup grated",
      "Parmesan cheese"
    ],
    [
      "16 ounces",
      "bowtie pasta"
    ],
    [
      "pinch",
      "Salt"
    ],
    [
      "pinch ",
      "Pepper"
    ],
    [
      "chopped",
      "Parsley"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695747"
  },
  "id": "52908",
  "title": "Ratatouille",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/wrpwuu1511786491.jpg",
  "instructions": [
    "Cut the aubergines in half lengthways. Place them on the board, cut side down, slice in half lengthways again and then across into 1.5cm chunks. Cut off the courgettes ends, then across into 1.5cm slices. Peel the peppers from stalk to bottom. Hold upright, cut around the stalk, then cut into 3 pieces. Cut away any membrane, then chop into bite-size chunks. Score a small cross on the base of each tomato, then put them into a heatproof bowl. Pour boiling water over the tomatoes, leave for 20 secs, then remove. Pour the water away, replace the tomatoes and cover with cold water. Leave to cool, then peel the skin away. Quarter the tomatoes, scrape away the seeds with a spoon, then roughly chop the flesh. Set a sauté pan over medium heat and when hot, pour in 2 tbsp olive oil. Brown the aubergines for 5 mins on each side until the pieces are soft. Set them aside and fry the courgettes in another tbsp oil for 5 mins, until golden on both sides. Repeat with the peppers. Don’t overcook the vegetables at this stage, as they have some more cooking left in the next step. Tear up the basil leaves and set aside. Cook the onion in the pan for 5 mins. Add the garlic and fry for a further min. Stir in the vinegar and sugar, then tip in the tomatoes and half the basil. Return the vegetables to the pan with some salt and pepper and cook for 5 mins. Serve with basil."
  ],
  "ingredients": [
    [
      "2 large",
      "Aubergine"
    ],
    [
      "4",
      "Courgettes"
    ],
    [
      "2",
      "Yellow Pepper"
    ],
    [
      "4 large",
      "Tomato"
    ],
    [
      "5 tbs",
      "Olive Oil"
    ],
    [
      "Bunch",
      "Basil"
    ],
    [
      "1 medium",
      "Onion"
    ],
    [
      "3 finely chopped",
      "Garlic Clove"
    ],
    [
      "1 tsp ",
      "Red Wine Vinegar"
    ],
    [
      "1 tsp ",
      "Sugar"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695749"
  },
  "id": "52811",
  "title": "Ribollita",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
  "instructions": [
    "Put 2 tablespoons of the oil in a large pot over medium heat. When it’s hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes. Heat the oven to 500 degrees. Drain the beans; if they’re canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thyme. Bring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes. Fish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan. Put the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve."
  ],
  "ingredients": [
    [
      "5 tablespoons",
      "Olive Oil"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "1 chopped",
      "Carrot"
    ],
    [
      "1 stalk chopped",
      "Celery"
    ],
    [
      "1 tablespoon minced",
      "Garlic"
    ],
    [
      "2 cups",
      "Cannellini Beans"
    ],
    [
      "1",
      "Canned tomatoes"
    ],
    [
      "4 cups",
      "Water"
    ],
    [
      "1 fresh sprig",
      "Rosemary"
    ],
    [
      "1 fresh sprig",
      "Thyme"
    ],
    [
      "1 pound chopped",
      "Kale"
    ],
    [
      "4 thick slices",
      "Wholegrain Bread"
    ],
    [
      "1 thinly sliced",
      "Red Onion"
    ],
    [
      "½ cup freshly grated",
      "Parmesan"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69574b"
  },
  "id": "52816",
  "title": "Roasted Eggplant With Tahini, Pine Nuts, and Lentils",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/ysqrus1487425681.jpg",
  "instructions": [
    " For the Lentils: Adjust oven rack to center position and preheat oven to 450°F to prepare for roasting eggplant. Meanwhile, heat 2 tablespoons olive oil in a medium saucepan over medium heat until shimmering. Add carrots, celery, and onion and cook, stirring, until softened but not browned, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add lentils, bay leaves, stock or water, and a pinch of salt. Bring to a simmer, cover with the lid partially ajar, and cook until lentils are tender, about 30 minutes. (Top up with water if lentils are at any point not fully submerged.) Remove lid, stir in vinegar, and reduce until lentils are moist but not soupy. Season to taste with salt and pepper, cover, and keep warm until ready to serve.  2. For the Eggplant: While lentils cook, cut each eggplant in half. Score flesh with the tip of a paring knife in a cross-hatch pattern at 1-inch intervals. Transfer to a foil-lined rimmed baking sheet, cut side up, and brush each eggplant half with 1 tablespoon oil, letting each brushstroke be fully absorbed before brushing with more. Season with salt and pepper. Place a rosemary sprig on top of each one. Transfer to oven and roast until completely tender and well charred, 25 to 35 minutes. Remove from oven and discard rosemary.  3. To Serve: Heat 2 tablespoons olive oil and pine nuts in a medium skillet set over medium heat. Cook, tossing nuts frequently, until golden brown and aromatic, about 4 minutes. Transfer to a bowl to halt cooking. Stir half of parsley and rosemary into lentils and transfer to a serving platter. Arrange eggplant halves on top. Spread a few tablespoons of tahini sauce over each eggplant half and sprinkle with pine nuts. Sprinkle with remaining parsley and rosemary, drizzle with additional olive oil, and serve."
  ],
  "ingredients": [
    [
      "2 tablespoons",
      "Olive Oil"
    ],
    [
      "2 small cut into chunks",
      "Carrots"
    ],
    [
      "2 small stalks",
      "Celery"
    ],
    [
      "1 medium finely diced",
      "Onion"
    ],
    [
      "6 medium cloves sliced",
      "Garlic"
    ],
    [
      "12 ounces (340g)",
      "Brown Lentils"
    ],
    [
      "2",
      "Bay Leaves"
    ],
    [
      "4 cups",
      "Water"
    ],
    [
      "Pinch",
      "Salt"
    ],
    [
      "2 teaspoons (10ml)",
      "Apple Cider Vinegar"
    ],
    [
      "Pinch",
      "Pepper"
    ],
    [
      "2 large",
      "Egg Plants"
    ],
    [
      "4 sprigs",
      "Rosemary"
    ],
    [
      "1/4 cup ",
      "Pine nuts"
    ],
    [
      "2 tablespoons",
      "Parsley"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69574d"
  },
  "id": "52850",
  "title": "Chicken Couscous",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg",
  "instructions": [
    "Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.  Tip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like."
  ],
  "ingredients": [
    [
      "1 tbsp",
      "Olive Oil"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "200g",
      "Chicken Breast"
    ],
    [
      "pinch",
      "Ginger"
    ],
    [
      "2 tblsp ",
      "Harissa Spice"
    ],
    [
      "10",
      "Dried Apricots"
    ],
    [
      "220g",
      "Chickpeas"
    ],
    [
      "200g",
      "Couscous"
    ],
    [
      "200ml",
      "Chicken Stock"
    ],
    [
      "Handful",
      "Coriander"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f69574f"
  },
  "id": "52963",
  "title": "Shakshuka",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/g373701551450225.jpg",
  "instructions": [
    "Heat the oil in a frying pan that has a lid, then soften the onions, chilli, garlic and coriander stalks for 5 mins until soft. Stir in the tomatoes and sugar, then bubble for 8-10 mins until thick. Can be frozen for 1 month.  Using the back of a large spoon, make 4 dips in the sauce, then crack an egg into each one. Put a lid on the pan, then cook over a low heat for 6-8 mins, until the eggs are done to your liking. Scatter with the coriander leaves and serve with crusty bread."
  ],
  "ingredients": [
    [
      "1 tbs",
      "Olive Oil"
    ],
    [
      "2 chopped",
      "Red Onions"
    ],
    [
      "1 finely chopped ",
      "Red Chilli"
    ],
    [
      "1 clove",
      "Garlic"
    ],
    [
      "Chopped",
      "Coriander"
    ],
    [
      "800g",
      "Cherry Tomatoes"
    ],
    [
      "1 tbs",
      "Caster Sugar"
    ],
    [
      "4",
      "Eggs"
    ],
    [
      "Spinkling",
      "Feta"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3d9d3ba309c7f695751"
  },
  "id": "52921",
  "title": "Provençal Omelette Cake",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/qwtrtp1511799242.jpg",
  "instructions": [
    "Break the eggs into two bowls, five in each. Whisk lightly and season with salt and pepper. Heat the oil in a pan, add the courgettes and spring onions, then fry gently for about 10 mins until softened. Cool, then stir into one bowl of eggs with a little salt and pepper. Add the roasted peppers to the other bowl of eggs with the garlic, chilli, salt and pepper. Heat a little oil in a 20-23cm frying pan, preferably non-stick. Pour the eggs with courgette into a measuring jug, then pourabout one-third of the mixture into the pan, swirling it to cover the base of the pan. Cook until the egg is set and lightly browned underneath, then cover the pan with a plate and invert the omelette onto it. Slide it back into the pan to cook the other side. Repeat with the remaining mix to make two more omelettes, adding a little oil to the pan each time. Stack the omelettes onto a plate. Make three omelettes in the same way with the red pepper mixture, then stack them on a separate plate. Now make the filling. Beat the cheese to soften it, then beat in the milk to make a spreadable consistency. Stir in the herbs, salt and pepper. Line a deep, 20-23cm round cake tin with cling film (use a tin the same size as the frying pan). Select the best red pepper omelette and place in the tin, prettiest side down. Spread with a thin layer of cheese filling, then cover with a courgette omelette. Repeat, alternating the layers, until all the omelettes and filling are in the tin, finishing with an omelette. Flip the cling film over the omelette, then chill for up to 24 hrs. To serve, invert the omelette cake onto a serving plate and peel off the cling film. Pile rocket on the top and scatter over the cheese, a drizzle of olive oil and a little freshly ground black pepper. Serve cut into wedges."
  ],
  "ingredients": [
    [
      "10",
      "Eggs"
    ],
    [
      "1 tbs",
      "Olive Oil"
    ],
    [
      "2 finely chopped",
      "Courgettes"
    ],
    [
      "3 finely chopped",
      "Spring Onions"
    ],
    [
      "4",
      "Red Pepper"
    ],
    [
      "1 clove peeled crushed",
      "Garlic Clove"
    ],
    [
      "1",
      "Red Chilli"
    ],
    [
      "300g",
      "Cream Cheese"
    ],
    [
      "6 tblsp",
      "Milk"
    ],
    [
      "4 tbs",
      "Chives"
    ],
    [
      "2 tbs",
      "Basil"
    ],
    [
      "to serve",
      "Rocket"
    ],
    [
      "to serve",
      "Parmesan"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695753"
  },
  "id": "52818",
  "title": "Chicken Fajita Mac and Cheese",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/qrqywr1503066605.jpg",
  "instructions": [
    "Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly. Add your cream, stock and macaroni. Cook on low for 20 minutes. Add your cheeses, stir to combine. Top with roasted peppers and parsley."
  ],
  "ingredients": [
    [
      "500g",
      "macaroni"
    ],
    [
      "2 cups",
      "chicken stock"
    ],
    [
      "1/2 cup",
      "heavy cream"
    ],
    [
      "1 packet",
      "fajita seasoning"
    ],
    [
      "1 tsp",
      "salt"
    ],
    [
      "3 diced",
      "chicken breast"
    ],
    [
      "2 tbsp",
      "olive oil"
    ],
    [
      "1 small finely diced",
      "onion"
    ],
    [
      "2 finely diced",
      "red pepper"
    ],
    [
      "2 cloves minced",
      "garlic"
    ],
    [
      "1 cup",
      "cheddar cheese"
    ],
    [
      "garnish chopped",
      "parsley"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695755"
  },
  "id": "52765",
  "title": "Chicken Enchilada Casserole",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/qtuwxu1468233098.jpg",
  "instructions": [
    "Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn't stick to the bottom. Remove chicken from the pot and shred with two forks. Preheat oven to 375 F degrees. Start layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese. Bake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top. Serve warm."
  ],
  "ingredients": [
    [
      "14 oz jar",
      "Enchilada sauce"
    ],
    [
      "3 Cups",
      "shredded Monterey Jack cheese"
    ],
    [
      "6",
      "corn tortillas"
    ],
    [
      "2",
      "chicken breasts"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695757"
  },
  "id": "52797",
  "title": "Spicy North African Potato Salad",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/urtwux1486983078.jpg",
  "instructions": [
    "Cook potatoes - place potatoes in a pot of cold water, and bring to the boil. Boil 20 minutes, or until potatoes are tender. You know they are cooked when you can stick a knife in them and the knife goes straight through. Combine harissa spice, olive oil, salt and pepper and lemon juice in a small bowl and whisk until combined. Once potatoes are cooked, drain water and roughly chop potatoes in half. Add harissa mix and spring onions/green onions to potatoes and stir. In a large salad bowl, lay out arugula/rocket. Top with potato mix and toss. Add fetta, mint and sprinkle over pine nuts. Adjust salt and pepper to taste."
  ],
  "ingredients": [
    [
      "650g/1lb 8 oz",
      "Small Potatoes"
    ],
    [
      "1 tsp",
      "Harissa Spice"
    ],
    [
      "2 tsp",
      "olive oil"
    ],
    [
      "juice of half",
      "Lemon"
    ],
    [
      "4",
      "Spring onions"
    ],
    [
      "150g/6oz",
      "Rocket"
    ],
    [
      "80g/3oz",
      "Feta"
    ],
    [
      "20 chopped",
      "Mint"
    ],
    [
      "2 tablespoons",
      "Pine nuts"
    ],
    [
      "Pinch",
      "Salt"
    ],
    [
      "Pinch",
      "Pepper"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695759"
  },
  "id": "52795",
  "title": "Chicken Handi",
  "category": "Chicken",
  "image": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg",
  "instructions": [
    "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside. To the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes. Then return the fried onion to the pot and stir. Add ginger paste and sauté well. Now add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir. Next goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes. Add the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat. When the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well. Finally add the cream and give a final mix to combine everything well. Sprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!"
  ],
  "ingredients": [
    [
      "1.2 kg",
      "Chicken"
    ],
    [
      "5 thinly sliced",
      "Onion"
    ],
    [
      "2 finely chopped",
      "Tomatoes"
    ],
    [
      "8 cloves chopped",
      "Garlic"
    ],
    [
      "1 tbsp",
      "Ginger paste"
    ],
    [
      "¼ cup",
      "Vegetable oil"
    ],
    [
      "2 tsp",
      "Cumin seeds"
    ],
    [
      "3 tsp",
      "Coriander seeds"
    ],
    [
      "1 tsp",
      "Turmeric powder"
    ],
    [
      "1 tsp",
      "Chilli powder"
    ],
    [
      "2",
      "Green chilli"
    ],
    [
      "1 cup",
      "Yogurt"
    ],
    [
      "¾ cup",
      "Cream"
    ],
    [
      "3 tsp Dried",
      "fenugreek"
    ],
    [
      "1 tsp",
      "Garam masala"
    ],
    [
      "To taste",
      "Salt"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f69575b"
  },
  "id": "52784",
  "title": "Smoky Lentil Chili with Squash",
  "category": "Vegetarian",
  "image": "https://www.themealdb.com/images/media/meals/uwxqwy1483389553.jpg",
  "instructions": [
    "Begin by roasting the squash. Slice it into thin crescents and drizzle with a little oil and sprinkle with sea salt. I added a fresh little sage I had in the fridge, but it’s unnecessary. Roast the squash a 205 C (400 F) for 20-30 minutes, flipping halfway through, until soft and golden. Let cool and chop into cubes. Meanwhile, rinse the lentils and cover them with water. Bring them to the boil then turn down to a simmer and let cook (uncovered) for 20-30 minutes, or until tender. Drain and set aside. While the lentils are cooking heat the 1 Tbsp. of oil on low in a medium pot. Add the onions and leeks and sauté for 5 or so minutes, or until they begin to soften. Add the garlic next along with the cumin and coriander, cooking for a few more minutes. Add the remaining spices – paprika, cinnamon, chilli, cocoa, Worcestershire sauce, salt, and oregano. Next add the can of tomatoes, the water or stock, and carrots. Let simmer, covered, for 20 minutes or until the veg is tender and the mixture has thickened up. You’ll need to check on the pot periodically for a stir and a top of of liquid if needed. Add the lentils and chopped roasted squash. Let cook for 10 more minutes to heat through. Serve with sliced jalapeno, lime wedges, cilantro, green onions, and cashew sour cream.  SIMPLE CASHEW SOUR CREAM  1 Cup Raw Unsalted Cashews Pinch Sea Salt 1 tsp. Apple Cider Vinegar Water  Bring some water to the boil, and use it to soak the cashews for at least four hours. Alternatively, you can use cold water and let the cashews soak overnight, but I’m forgetful/lazy, so often use the boil method which is much faster. After the cashews have soaked, drain them and add to a high speed blender. Begin to puree, slowly adding about 1/2 cup fresh water, until a creamy consistency is reached. You may need to add less or more water to reach the desired consistency. Add a pinch of sea salt and vinegar (or lemon juice)."
  ],
  "ingredients": [
    [
      "1 tbls",
      "Olive Oil"
    ],
    [
      "1",
      "Onion"
    ],
    [
      "1 chopped",
      "Leek"
    ],
    [
      "3 cloves",
      "Garlic"
    ],
    [
      "4 tsp ground ",
      "Cumin"
    ],
    [
      "2 tsp ground",
      "Coriander"
    ],
    [
      "1 tsp",
      "Smoked Paprika"
    ],
    [
      "1/2 tsp",
      "Cinnamon"
    ],
    [
      "1 tsp",
      "Chili Powder"
    ],
    [
      "1 tsp",
      "Cocoa"
    ],
    [
      "1/2 tsp",
      "Dried Oregano"
    ],
    [
      "1 can",
      "Diced Tomatoes"
    ],
    [
      "3 cups",
      "Water"
    ],
    [
      "3 chopped",
      "Carrots"
    ],
    [
      "1 1/2 cups",
      "Brown Lentils"
    ],
    [
      "1 tsp",
      "Sea Salt"
    ],
    [
      "1 Small",
      "Squash"
    ],
    [
      "1 Cup",
      "Cashews"
    ],
    [
      "1 tsp",
      "Apple Cider Vinegar"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f69575d"
  },
  "id": "52965",
  "title": "Breakfast Potatoes",
  "category": "Breakfast",
  "image": "https://www.themealdb.com/images/media/meals/1550441882.jpg",
  "instructions": [
    "Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop! Wash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water. In the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly. Once the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed. Cook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil. Chop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp. Once the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed. Let the garlic cook until fragrant, about one minute. Just before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect. Serve in a warm bowl with a sunny side up egg!"
  ],
  "ingredients": [
    [
      "3 Medium",
      "Potatoes"
    ],
    [
      "1 tbs",
      "Olive Oil"
    ],
    [
      "2 strips",
      "Bacon"
    ],
    [
      "Minced",
      "Garlic Clove"
    ],
    [
      "1 tbs",
      "Maple Syrup"
    ],
    [
      "Garnish",
      "Parsley"
    ],
    [
      "Pinch",
      "Salt"
    ],
    [
      "Pinch",
      "Pepper"
    ],
    [
      "To taste",
      "Allspice"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f69575f"
  },
  "id": "52967",
  "title": "Home-made Mandazi",
  "category": "Breakfast",
  "image": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg",
  "instructions": [
    "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them. You can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon. For “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.  1. Mix the flour,cinnamon and sugar in a suitable bowl. 2. In a separate bowl whisk the egg into the milk 3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough. 4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface. 5. Cover the dough with a damp cloth  and allow to rest for 15 minutes. 6. Roll the dough on a lightly floured surface into a 1cm thick piece. 7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying. 8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side. 9. Serve them warm or cold"
  ],
  "ingredients": [
    [
      "750g",
      "Self-raising Flour"
    ],
    [
      "6 tablespoons",
      "Sugar"
    ],
    [
      "2",
      "Eggs"
    ],
    [
      "1 cup ",
      "Milk"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695761"
  },
  "id": "52964",
  "title": "Smoked Haddock Kedgeree",
  "category": "Breakfast",
  "image": "https://www.themealdb.com/images/media/meals/1550441275.jpg",
  "instructions": [
    "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook gently over a medium heat for 5 minutes, until softened but not browned.  Stir in 3 split cardamom pods, ¼ tsp turmeric, 1 small cinnamon stick and 2 bay leaves, then cook for 1 minute.  Tip in 450g basmati rice and stir until it is all well coated in the spicy butter.  Pour in 1 litre chicken or fish stock, add ½ teaspoon salt and bring to the boil, stir once to release any rice from the bottom of the pan. Cover with a close-fitting lid, reduce the heat to low and leave to cook very gently for 12 minutes.  Meanwhile, bring some water to the boil in a large shallow pan. Add 750g un-dyed smoked haddock fillet and simmer for 4 minutes, until the fish is just cooked. Lift it out onto a plate and leave until cool enough to handle.  Hard-boil 3 eggs for 8 minutes.  Flake the fish, discarding any skin and bones. Drain the eggs, cool slightly, then peel and chop.   Uncover the rice and remove the bay leaves, cinnamon stick and cardamom pods if you wish to. Gently fork in the fish and the chopped eggs, cover again and return to the heat for 2-3 minutes, or until the fish has heated through.  Gently stir in almost all the 3 tbsp chopped fresh parsley, and season with a little salt and black pepper to taste. Serve scattered with the remaining parsley and garnished with 1 lemon, cut into wedges."
  ],
  "ingredients": [
    [
      "50g",
      "Butter"
    ],
    [
      "1 chopped",
      "Onion"
    ],
    [
      "3 Pods",
      "Cardamom"
    ],
    [
      "1/4 tsp",
      "Turmeric"
    ],
    [
      "1 small",
      "Cinnamon Stick"
    ],
    [
      "Sprigs of fresh",
      "Bay Leaf"
    ],
    [
      "450g",
      "Basmati Rice"
    ],
    [
      "1 Litre",
      "Chicken Stock"
    ],
    [
      "750g",
      "Smoked Haddock"
    ],
    [
      "3",
      "Eggs"
    ],
    [
      "3 tblsp chopped",
      "Parsley"
    ],
    [
      "1 chopped",
      "Lemon"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695763"
  },
  "id": "52968",
  "title": "Mbuzi Choma (Roasted Goat)",
  "category": "Goat",
  "image": "https://www.themealdb.com/images/media/meals/cuio7s1555492979.jpg",
  "instructions": [
    "1. Steps for the Meat:   Roast meat over medium heat for 50 minutes and salt it as you turn it.  2. Steps for Ugali: Bring the water and salt to a boil in a heavy-bottomed saucepan. Stir in the cornmeal slowly, letting it fall through the fingers of your hand.  3. Reduce heat to medium-low and continue stirring regularly, smashing any lumps with a spoon, until the mush pulls away from the sides of the pot and becomes very thick, about 10 minutes.  4.Remove from heat and allow to cool.  5. Place the ugali into a large serving bowl. Wet your hands with water, form a ball and serve.  6. Steps for Kachumbari: Mix the tomatoes, onions, chili and coriander leaves in a bowl.  7. Serve and enjoy!  "
  ],
  "ingredients": [
    [
      "1 kg",
      "Goat Meat"
    ],
    [
      "1 kg",
      "Corn Flour"
    ],
    [
      "2",
      "Tomatoes"
    ],
    [
      "Pinch",
      "Salt"
    ],
    [
      "1",
      "Onion"
    ],
    [
      "1",
      "Green Chilli"
    ],
    [
      "1  bunch",
      "Coriander Leaves"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695765"
  },
  "id": "52919",
  "title": "Fennel Dauphinoise",
  "category": "Side",
  "image": "https://www.themealdb.com/images/media/meals/ytttsv1511798734.jpg",
  "instructions": [
    "Heat oven to 180C/160C fan/gas 4. Put potatoes, fennel, and garlic in a medium non-stick pan. Pour in milk and double cream, season well and simmer gently, covered, for 10 mins, stirring halfway through, until potatoes are just tender. Divide the mixture between 2 small (about 150ml) buttered ramekins and scatter with Parmesan. Bake for 40 mins until the potatoes are golden and tender when pierced with a knife. Snip the reserved fennel fronds over before serving."
  ],
  "ingredients": [
    [
      "225g",
      "Potatoes"
    ],
    [
      "1 small",
      "Fennel"
    ],
    [
      "1 clove finely chopped",
      "Garlic"
    ],
    [
      "75 ml ",
      "Milk"
    ],
    [
      "100ml",
      "Double Cream"
    ],
    [
      "For Greasing",
      "Butter"
    ],
    [
      "to serve",
      "Parmesan Cheese"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695767"
  },
  "id": "53030",
  "title": "Feteer Meshaltet",
  "category": "Side",
  "image": "https://www.themealdb.com/images/media/meals/9f4z6v1598734293.jpg",
  "instructions": [
    "Mix the flour and salt then pour one cup of water and start kneading. If you feel the dough is still not coming together or too dry, gradually add the remaining water until you get a dough that is very elastic so that when you pull it and it won’t be torn. Let the dough rest for just 10 minutes then divide the dough into 6-8 balls depending on the size you want for your feteer. Warm up the butter/ghee or oil you are using and pour into a deep bowl. Immerse the dough balls into the warm butter. Let it rest for 15 to 20 minutes. Preheat oven to 550F. Stretch the first ball with your hands on a clean countertop. Stretch it as thin as you can, the goal here is to see your countertop through the dough. Fold the dough over itself to form a square brushing in between folds with the butter mixture. Set aside and start making the next ball. Stretch the second one thin as we have done for the first ball. Place the previous one on the middle seam side down. Fold the outer one over brushing with more butter mixture as you fold. Set aside. Keep doing this for the third and fourth balls. Now we have one ready, place on a 10 inch baking/pie dish seam side down and brush the top with more butter. Repeat for the remaining 4 balls to make a second one. With your hands lightly press the folded feteer to spread it on the baking dish. Place in preheated oven for 10 minutes when the feteer starts puffing turn on the broiler to brown the top. When it is done add little butter on top and cover so it won’t get dry."
  ],
  "ingredients": [
    [
      "4 cups ",
      "Flour"
    ],
    [
      "1 1/2 cups ",
      "Water"
    ],
    [
      "1/4 tsp",
      "Salt"
    ],
    [
      "1 cup ",
      "Unsalted Butter"
    ],
    [
      "1/4 cup",
      "Olive Oil"
    ]
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "621fc3dad3ba309c7f695769"
  },
  "id": "52767",
  "title": "Bakewell tart",
  "category": "Dessert",
  "image": "https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg",
  "instructions": [
    "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough. Roll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes. Preheat the oven to 200C/400F/Gas 6 (180C fan). Line the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base. For the filing, spread the base of the flan generously with raspberry jam. Melt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds. Bake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning."
  ],
  "ingredients": [
    [
      "175g/6oz",
      "plain flour"
    ],
    [
      "75g/2½oz",
      "chilled butter"
    ],
    [
      "2-3 tbsp",
      "cold water"
    ],
    [
      "1 tbsp",
      "raspberry jam"
    ],
    [
      "125g/4½oz",
      "butter"
    ],
    [
      "125g/4½oz",
      "caster sugar"
    ],
    [
      "125g/4½oz",
      "ground almonds"
    ],
    [
      "1",
      "free-range egg, beaten"
    ],
    [
      "½ tsp",
      "almond extract"
    ],
    [
      "50g/1¾oz",
      "flaked almonds"
    ]
  ],
  "__v": 0
}]